{"bas-rus-Cyrl-Latn-2017-bss":{"authority_id":"bas","id":"2017-bss","language":"iso-639-2:rus","source_script":"Cyrl","destination_script":"Latn","name":"Streamlined Romanization of Russian Cyrillic -- Basic Streamlined System","url":"https://www.researchgate.net/publication/318402098","creation_date":"2017-07","description":"The streamlined approach to transliteration was initiated by the\nauthor with the development of the Streamlined System for the\nRomanization of Bulgarian, which was eventually codified by the\nTransliteration Act of 2009 (ДВ 2009) of the Bulgarian Parliament.\n\nThe four purposes of the system below are in order of priority:\n1. ensure a plausible phonetic approximation of Russian words by English speaking users, including those having no knowledge of the Russian language and no available additional explanations;\n2. the system should allow for the retrieval of the original Cyrillic spellings as much as feasible;\n3. transliterated Russian words should fit an English language environment i.e. not be perceived as too ‘un-English’; and\n4. transliterated word forms should be streamlined and simple. (Ivanov 2003, Ivanov et al. 2010)\n","notes":["Typical for the streamlined approach is its non-use of diacritics, its use of Latin y for rendering only Cyrillic й rather than both й and ы, its non-use of Latin j, as well as its use of Latin h rather than kh for Cyrillic х."],"tests":[{"source":"Эх, тройка! птица тройка, кто тебя выдумал? знать, у бойкого народа\nты могла только родиться, в той земле, что не любит шутить, а\nровнем-гладнем разметнулась на полсвета, да и ступай считать версты, пока\nне зарябит тебе в очи. И не хитрый, кажись, дорожный снаряд, не\nжелезным схвачен винтом, а наскоро живьём с одним топором да долотом\nснарядил и собрал тебя ярославский расторопный мужик. Не в немецких\nботфортах ямщик: борода да рукавицы, и сидит чёрт знает на чём; а\nпривстал, да замахнулся, да затянул песню — кони вихрем, спицы в\nколесах смешались в один гладкий круг, только дрогнула дорога, да вскрикнул\nв испуге остановившийся пешеход — и вон она понеслась, понеслась,\nпонеслась!\n\nН.В. Гоголь\n","expected":"Eh, troyka! ptitsa troyka, kto tebya vidumal? znat, u boykogo naroda\nti mogla tolko roditsya, v toy zemle, chto ne lyubit shutit, a\nrovnem-gladnem razmetnulas na polsveta, da i stupay schitat versti, poka\nne zaryabit tebe v ochi. I ne hitriy, kazhis, dorozhniy snaryad, ne\nzheleznim shvachen vintom, a naskoro zhivyem s odnim toporom da dolotom\nsnaryadil i sobral tebya yaroslavskiy rastoropniy muzhik. Ne v nemetskih\nbotfortah yamshchik: boroda da rukavitsi, i sidit chert znaet na chem; a\nprivstal, da zamahnulsya, da zatyanul pesnyu — koni vihrem, spitsi v\nkolesah smeshalis v odin gladkiy krug, tolko drognula doroga, da vskriknul\nv ispuge ostanovivshiysya peshehod — i von ona poneslas, poneslas,\nponeslas!\n\nN.V. Gogol\n"},{"source":"ЁЖ Ёж ёж","expected":"EZH Ezh ezh"},{"source":"Цветущий сад","expected":"Tsvetushchiy sad"},{"source":"Чувство юмора","expected":"Chuvstvo yumora"},{"source":"Широкий выбор","expected":"Shirokiy vibor"},{"source":"Все подъезды заблокированны","expected":"Vse podezdi zablokirovanni"},{"source":"Ожерелье","expected":"Ozherelye"},{"source":"Ручьи","expected":"Ruchyi"},{"source":"Каньон","expected":"Kanyon"},{"source":"Бельэтаж","expected":"Belyetazh"}],"map":{"rules":[{"pattern":"\\u042c(?=[ЕеЁёИиОоЭэ])","result":"Y"},{"pattern":"\\u044c(?=[ЕеЁёИиОоЭэ])","result":"y"}],"characters":{"А":"A","Б":"B","В":"V","Г":"G","Д":"D","Ё":"E","Е":"E","Ж":"Zh","З":"Z","Э":"E","И":"I","Й":"Y","К":"K","Л":"L","М":"M","Н":"N","О":"O","П":"P","Р":"R","С":"S","Т":"T","У":"U","Ф":"F","Х":"H","Ц":"Ts","Ч":"Ch","Ш":"Sh","Щ":"Shch","Ы":"I","Я":"Ya","Ю":"Yu","Ь":"","Ъ":"","а":"a","б":"b","в":"v","г":"g","д":"d","ё":"e","е":"e","ж":"zh","з":"z","э":"e","и":"i","й":"y","к":"k","л":"l","м":"m","н":"n","о":"o","п":"p","р":"r","с":"s","т":"t","у":"u","ф":"f","х":"h","ц":"ts","ч":"ch","ш":"sh","щ":"shch","ы":"i","я":"ya","ю":"yu","ь":"","ъ":""}}}}