{"bgn-jpn-Hrkt-Latn-1962":{"authority_id":"bgn","id":1962,"language":"iso-639-2:jpn","source_script":"Hrkt","destination_script":"Latn","name":"BGN (Modified Hepburn) System","url":null,"creation_date":1930,"adoption_date":1962,"description":"The BGN (Modified Hepburn) System for the transliteration of Japanese\nhas been in use by the Board on Geographic Names since about 1930 and\nhas been extensively employed in the systematic standardsization of\nthousands of geographic names of Japan in romanized form.\n","notes":"\n1. The \"tsu\" forms (ツ/つ) are also used to indicate a double consonant and\nare generally (but not alwyas) written in smaller script or type\nslightly to the right of or below the regular line. These characters\nare trasnliterated as k before k; s before s or sh; t before t, ts, or\nch; and p before p. Occasionally, when a \"ku\" (ク/く) or \"ki\" (キ/き) form\nprecedes k, the u in ku or the i in ki is dropped.\n\n2. The transliterations in parentheses are used in specific cases when\nthe kana symbol is known to be so pronounced.\n\n3. The transliteration m is used before b, p, and m.\n\n4. This letter has been added for the use in transliterating foreign\nwords.\n\n5. The asterisk (*) indicates standard combined forms. Those combined\nforms not so marked are rarely used.\n\n----\n\nImplementation Notes:\n\na. Despite the mentioning of the term \"Modified Hepburn\" in the\nspecification, the handling of ん/ン in this standard is different from\nModified Hepburn. It follows the Traditional Hepburn in that the\nletter m is used before b, m, p.\n\nb. This document includes obsolete (pre-reform) combinations.\nPre-reform combinations will clash with modern Japanese transliteration.\n\nc. There is no discussion on how cross-morpheme vowel sounds should be\nhandled.\n\nd. There is no mentioning of separation mark between n and another vowel.\n\ne. Everything not explicitly stated in the specification will be\nassumed to be inherited from var-jpn-Hrkt-Latn-hepburn-1954.\n\nf. Obsolete combinations can be handled by post rules, and are\nincluded for the sake of completeness only. They have been commented\nout, since they are rarely used and follow different rules than modern\nJapanese.\n","tests":[{"source":"しんばし","expected":"shimbashi"},{"source":"とうきょう","expected":"tōkyō"},{"source":"しんじゅく","expected":"shinjuku"},{"source":"かんおう","expected":"kan’ō"},{"source":"かのう","expected":"kanō"},{"source":"きんゆう","expected":"kin’yū"},{"source":"とうきょう","expected":"tōkyō"},{"source":"かごっま","expected":"kagomma"},{"source":"ぽっぽっや","expected":"poppoyya"},{"source":"てっら","expected":"terra"},{"source":"にゃっほー","expected":"nyahhō"}],"map":{"inherit":"var-jpn-Hrkt-Latn-hepburn-1954","rules":[{"pattern":"[んン](?=[ばびぶべぼまみむめもぱぴぷぺぽバビブベボマミムメモパピプペポ])","result":"m"}],"postrules":null,"characters":{"け":["ke","ga","ka","ko"],"ケ":["ke","ga\"","ka","ko"],"ヶ":["ga","ka","ko"],"は":["ha","wa"],"ひ":["hi","i"],"ふ":["fu","u","o"],"へ":["he","e"],"ほ":["ho","o"],"ハ":["ha","wa"],"ヒ":["hi","i"],"フ":["fu","u","o"],"ヘ":["he","e"],"ホ":["ho","o"],"ゐ":"i","ゑ":"e","ヰ":"i","ヱ":"e","くわ":"ka","くわう":"kō","ぐわ":"ga","ぐわう":"gō","クワ":"ka","クワウ":"kō","グワ":"ga","グワウ":"gō"}}}}