{"bgnpcgn-ara-Arab-Latn-1956":{"authority_id":"bgnpcgn","id":1956,"language":"iso-639-2:ara","source_script":"Arab","destination_script":"Latn","name":"ROMANIZATION OF ARABIC -- BGN/PCGN 1956 System","alias":{"ogc11122":{"code":"ara_Arab2Latn_BGN_1956","description":"Arabic US Board on Geographic Names(BGN)/Permanent Committee on Geographical Names for British Official Use(PCGN) 1956 System"}},"url":"https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/858000/ROMANIZATION_OF_ARABIC.pdf","creation_date":1956,"confirmation date":"2019-12","description":"\nThis System was adopted by the BGN in 1946 and by the PCGN in 1956 and is applied by BGN and PCGN in the systematic romanization of Arabic geographical names in Bahrain, Egypt, Iraq, Jordan, Kuwait, Libya, Oman, Qatar, Saudi Arabia, Syria, the United Arab Emirates, Yemen, the West Bank and Gaza Strip.\n\nUniform results in the romanization of Arabic are difficult to obtain, since vowel points and diacritical marks are generally omitted from both handwriting and printed script. It follows that for correct identification of the words which appear in any particular name, knowledge of its standard Arabic-script spelling including proper pointing, and recognition of dialectal and idiosyncratic deviations are essential.\n\nIn order to bring about uniformity in the Roman-script spelling of geographical names in Arabic-language areas, the system is based insofar as possible on fully pointed Modern Standard Arabic (MSA). In the interest of clarity, vowel pointing to indicate short vowels has been applied to the examples given below, and examples of the, more usual, unpointed script have also been provided; it should also be noted that the dots which occur on some characters of the Arabic script are not vowels but rather are an integral part of the base consonant.\n\nArabic script is written from right to left, and does not make a distinction between upper and lower case.\n","notes":"\n- (NOTE 1) The symbol ◌ is used in this system to symbolise any Arabic consonant character. It is not itself an Arabic letter.\n\n- (NOTE 2) Hamzah (ء) is written in Arabic in association with most instances of initial alif, except those which belong to the definite article al or which bear a maddah (see note 9). Hamzah is written above the alif ( أَ) if the accompanying short vowel is a fatḩah or ḑammah and usually below the alif( أ ) if the accompanying short vowel is a kasrah.\n  When the purpose is to indicate the presence of a glottal stop, hamzah is written over medial alif ( أ ), wāw (ؤ) and yā’, typically without dots (ئ); or following final alif ( أ ء ), these characters serving only to “bear” the hamzah. Hamzah following kasrah ( ) is written (ئ); the yā’ is usually in the initial or medial form and the dots are omitted e.g. bi’r ( بئ ر ).\n  Hamzah following ḑammah ( ) is written (ؤ). Hamzah following a long vowel is written without a bearer and is positioned on the line of print like a regular character, e.g. صنعاء Şan‘ā’. The romanization of hamzah (’ - Unicode encoding 2019) should always be carefully distinguished from that of ‘ayn (‘ - Unicode encoding 2018).\n\n- (NOTE 3) Alif (ا) occurs with the following uses\n  a. Initially, it indicates that the word begins with a vowel or diphthong; the alif itself is not romanized, but rather “carries” the short vowel, which is romanized; e.g., ظب ي أبو → Abū Z̧aby.\n\n  b. With maddah (آ – row 18 in the vowel table), it is represented ā; e.g., مُ عيط آلب و → Ālbū Mu‘ayţ. See also note 9.\n\n  c. Medially and finally it is represented ā; e.g., ب ا ب → Bāb, صيدا → Şaydā.\n\n  d. Medially and finally, alif may serve as the bearer of hamzah, e.g. رأس → ra’s. See also note 2.\n\n- (NOTE 4) The tā’ marbūţah character (ة), which looks like hā’ with two dots above and occurs only at the end of words, is romanized h, except in an iḑāfah noun phrase construction, where it is romanized t, in accordance with pronunciation. e.g. Muḩāfaz̧ah (as an isolated word) but Muḩāfaz̧at Baghdād. In exceptional cases, when it is necessary to distinguish it from the tā’ marbūţah, the ending fatḩah + hā’ ( ه ) may be romanized a·h when the character hā’ (ه) is pronounced as such. Example Muntaza·h. (see also special rule 13). The tā marbūţah is always preceded by the short vowel fatḩah ( ) and is therefore romanized as ah or at, except when it is preceded by alif when it is romanized āh (not āah), e.g. Ḩamāh (حماة ), and as āt within an iḑāfah construction.\n\n- (NOTE 5) The character yā’ (in final form but without dots) preceded by the vowel point fatḩah is known as alif maqşūrah. This character may also be pointed ى and should be romanized á. See character 7 in the vowel table.\n\n- (NOTE 6) The classical Arabic grammatical endings written with the nunation symbols (tanwīn) may be romanized, when necessary, by an, in, un. In modern spoken Arabic, these endings have become silent and should not be romanized e.g. classical alifun; modern alif.\n\n- (NOTE 7) Doubled consonant sounds are represented in Arabic script by placing a shaddah ( ) over a consonant character, although like the short vowels the shaddah may not always be written. In romanization the letter should be doubled, e.g. Quwwah, ‘Abbās. However, the combination of the consonant character yā’ with a shaddah preceded by a kasrah ( ي ) at the end of a word is romanized ī, e.g. Gharbī; a word ending kasrah + yā’ with a shaddah + tā’ marbūţah is romanized īyah (rather than iyyah), e.g. ال س ل يمانِ ية\nis romanized As Sulaymānīyah and not As Sulaymāniyyah; and when the kasrah + yā’ + shaddah combination is followed by the sound masculine plural ending ( يين or يون ) it should be romanized as –īyīn/īyūn, e.g. ساحة العباسيين should be romanized as Sāḩat al ‘Abbāsīyīn.\n\n- (NOTE 8) Hamzat al waşl (ٱ), which is utilized only in the pointing of classical Arabic, is romanized ’ as illustrated in the classical form of its name hamzatu’l waşli.\n\n- (NOTE 9) Since maddah ( أ ), which is placed over alif ( أ ), often occurs in word-initial position, no confusion results from the use of ā for alif maddah ( أ ) as well as for fatḩah followed by alif ( اَ ).\n\n- (NOTE 10) The ligature ل ا represents lām-alif, and should be romanized lā.\n\n- (NOTE 11) In word initial position the combination Alif +Wāw (او ) is sometimes used to render an initial long vowel sound in words of non-Arabic origin. Where this is clearly the case it should be romanized Ū. In words of Arabic or uncertain origin it should be romanized Aw. In word-medial or word-final position it should always be romanized āw. Similarly the combination Alif +Yā’ (اي ) is romanized Ī to render an initial long vowel sound but as āy in word-medial or word-final position.\n\n# SPECIAL RULES\n\n- The Arabic definite article al (ال ) should be treated as follows |\n  a. Initial definite articles should be capitalized and hyphens should not be used to connect parts of names, e.g. Ash Shāriqah. When appearing medially in a name the initial ‘a’ should be lower case, e.g. Tall al Laḩm.\n\n  b. When the definite article precedes a word beginning with one of the “sun letters” t, th, d, dh, r, z, s, sh, ş, ḑ, ţ, z̧, l, or n – the l is assimilated in pronunciation and romanization, thus yielding, for example, the romanization Ar Riyāḑ, rather than Al Riyāḑ for ال ريا ض .\n\n  c. If sources contradict over the inclusion or non-inclusion of the definite article in a name, preference should be given to the form with the article.\n\n- Conjunctions and prepositions should be romanized according to their written form in Arabic script and should be lower case. In cases where the conjunction or preposition ends in a long or short vowel any assimilated pronunciation should not be shown in the romanized form. e.g. Khabb wa ash Sha‘f (خب والشعف ). |\n\n  There are two exceptions to this rule\n\n  a. In the case of the preposition li (ل), where the alif of the definite article is assimilated in the written form as well as pronunciation, the written form should be shown in romanization as follows Mişr liţ Ţayarān (مصر للطيران ); Ash Sharikah al ‘Āmmah lil Maghāzil (الشركة العامة للمغازل ).\n\n  b. In the case of the preposition bi (ب), the alif of the definite article is assimilated in pronunciation and, although the alif remains in the written form the short vowel it carries changes from ‘a’ to ‘i’. For example Al Qaryah bid Duwayr (القرية بالدوير ) but Ad Duwayr (الدوير ); and Al Ḩarajah bil Qur’ān (الحرجة بالقرآن ) but Al Qur’ān (القرآن ).\n\n\n- The Arabic word for God ( لله) should be written Allāh. The alif khanjarīyah (dagger alif) ( ) above the second ل (lām) in the word لله , like the short vowels, is not usually written but should be romanized ā, like a full-size alif. This diacritical mark appears in a few other Arabic words, for instance on the alif maqşūrah as described in note 5.\n\n- Names which consist of noun phrases (see also note 4) should be written as separate words. The definite article within such names should be romanized al, not ul, e.g., ‘Abd Allāh, ‘Abd ar Raḩmān, Dhū al Faqār, and as noted in special rule 1, the medial al should be lower case.\n\n- The Arabic word ب ن should be romanized Bin rather than Ibn whenever written without alif, that is between two proper nouns, e.g., ‘Umar Bin al Khaţţāb. Where it appears with alif ( )اب ن , it should be romanized Ibn.\n\n- The Turkish word Paşa should be romanized from Arabic script as Bāshā. The Turkish word Bey should be romanized as Bey in Egyptian names, no matter how it is written in Arabic-language sources, but in other Arabic areas it should be romanized as Bak where written بك and as Bayk when written بيك .\n\n- The modern colloquial word Sīdī (سيدي ) should be give precedence over the classical form Sayyidī. This does not preclude the spelling Sayyidī if the latter is indicated by the Arabic script or other evidence – for instance, if the yā’ is written with a shaddah ( ).\n\n- The colloquial word Bū should not be changed to the standard form Abū.\n\n- The colloquial word for water, written مي ة on Arabic maps, should be romanized Mayyat.\n\n- Place names of Aramaic origin in Syria often contain initial consonant clusters consisting of b plus another consonant such as l or h. In romanization, the clusters bl, bh, etc., should be so represented.\n\n- In names containing the Arabic word for back, ridge, or hill, appearing as either ظهر (Z̧ahr) or ضه ر (Ḑahr) in Arabic sources, the word should be romanized to reflect the particular Arabic spelling shown. Where sources differ, preference should be given to the form found on the most authoritative source.\n\n- In formal Arabic, the spelling of some words ending in a long vowel character may change according to that word’s grammatical function in a sentence. For example, the personal name Abū Bakr (ابو بكر ) would become Abī Bakr (ابي بكر ) when preceded by a generic in an iḑāfah construction (used in Moroccan Arabic Script) e.g. Shāri‘ Abī Bakr (شارع ابي بكر – Abu Bakr Street). The spelling of such words as found on the most authoritative source should be used in the romanized form of the name. Other common words affected by this rule are Banū/Banī (sons of…) and Dhū/Dhī (owner of ...). Examples of names in this category include Jabal Abā aş Şabbān (جبل ابا الصبان ) and Muḩāfaz̧at Dhī Qār ( محافظة ذي قار ).\n\n- Occasionally the character sequences ك ه , ده , س ه , and ت occur. They may be romanized k·h, d·h, s·h, and t·h in order to differentiate these romanizations from the digraphs kh, dh, sh, and th, which are used to represent the characters خ, ذ, ش, and ث respectively. See also note 4.\n","tests":[{"source":"قُرآن","expected":"Qur’ān"},{"source":"أَبُو ظَبْي","expected":"Abū Z̧aby"},{"source":"بِئْر زَيْت","expected":"Bi’r Zayt"},{"source":"أُمّ العَمَد","expected":"Umm al ‘Amad"},{"source":"البَحرَيْن","expected":"Al Baḩrayn"},{"source":"الكُوت","expected":"Al Kūt"},{"source":"الثُّلَيثُوَات","expected":"Ath Thulaythuwāt"},{"source":"الجَزِيرَة","expected":"Al Jazīrah"},{"source":"المَحْمُودِيَّة","expected":"Al Maḩmūdīyah"},{"source":"خَيْبَر","expected":"Khaybar"},{"source":"دَمَنْهُور","expected":"Damanhūr"},{"source":"ذَهَب","expected":"Dhahab"},{"source":"الرَّوْضة","expected":"Ar Rawḑah"},{"source":"زُوَارَة","expected":"Zuwārah"},{"source":"السُّلَيْمانِيَّة","expected":"As Sulaymānīyah"},{"source":"الشَّام","expected":"Ash Shām"},{"source":"قَيْصُومَة","expected":"Qayşūmah"},{"source":"ضَوْر","expected":"Ḑawr"},{"source":"القُنَيْطِرَة","expected":"Al Qunayţirah"},{"source":"ظُفَار","expected":"Z̧ufār"},{"source":"أَبُو عَرِيش","expected":"Abū ‘Arīsh"},{"source":"بَغْداد","expected":"Baghdād"},{"source":"الفُرات","expected":"Al Furāt"},{"source":"قَطَر","expected":"Qaţar"},{"source":"الكُوَيْت","expected":"Al Kuwayt"},{"source":"حَلَب","expected":"Ḩalab"},{"source":"مَكَّة","expected":"Makkah"},{"source":"نَخْل","expected":"Nakhl"},{"source":"جَبَل هارُون","expected":"Jabal Hārūn"},{"source":"وادِي غَضَا","expected":"Wādī Ghaḑā"},{"source":"اليَمَن","expected":"Al Yaman"},{"source":"القاهِرَة","expected":"Al Qāhirah"},{"source":"المَدِينَة المُنَوَّرَة","expected":"Al Madīnah al Munawwarah"},{"source":"مُحَافَظَة دِمَشْق","expected":"Muḩāfaz̧at Dimashq"},{"source":"البَصْرَة","expected":"Al Başrah"},{"source":"الرِّيَاض","expected":"Ar Riyāḑ"},{"source":"القُدْس","expected":"Al Quds"},{"source":"بَاب المَنْدَب","expected":"Bāb al Mandab"},{"source":"المَدِينة","expected":"Al Madīnah"},{"source":"صُور","expected":"Şūr"},{"source":"مَرْسَىٰ مَطْرُوح","expected":"Marsá Maţrūḩ"},{"source":"صَيْدَا","expected":"Şaydā"},{"source":"الدَّوحَة","expected":"Ad Dawḩah"},{"source":"مُحَمَّد","expected":"Muḩammad"},{"source":"أُوزُونْلَار","expected":"Ūzūnlār"},{"source":"أَوْسَط","expected":"Awsaţ"},{"source":"سَنَاو","expected":"Sanāw"},{"source":"اِيرَان","expected":"Īrān"},{"source":"تَلّ السَّرَاي","expected":"Tall as Sarāy"},{"source":"آلْبُو مُعَيْط","expected":"Ālbū Mu‘ayţ"},{"source":"سَلْمان پَاك","expected":"Salmān Pāk"},{"source":"تَلّ كُوچِك الصَّغِير","expected":"Tall Kūchik aş Şaghīr"},{"source":"ڨَفْصَة","expected":"Gafşah"},{"source":"تَلّ گَمْر","expected":"Tall Gamr"},{"source":"زَاڴُورَة","expected":"Zāgūrah"},{"source":"اِيران","expected":"Īrān"}],"map":{"postrules":[{"pattern":"(?<=\\b)(?<!\\b[‘|’])[\\u0061-\\uFFFF]","result":"upcase"},{"pattern":" At T","result":" at T"},{"pattern":" Ath Th","result":" ath th"},{"pattern":" Ad D","result":" ad D"},{"pattern":" Adh Dh","result":" adh Dh"},{"pattern":" Ar R","result":" ar R"},{"pattern":" Az Z","result":" az Z"},{"pattern":" As S","result":" as S"},{"pattern":" Ash Sh","result":" ash Sh"},{"pattern":" Aş Ş","result":" aş Ş"},{"pattern":" Aḑ Ḑ","result":" aḑ Ḑ"},{"pattern":" Aţ Ţ","result":" aţ Ţ"},{"pattern":" Az̧ Z̧","result":" az̧ Z̧"},{"pattern":" Al L","result":" al L"},{"pattern":" An N","result":" an N"},{"pattern":" Al ","result":" al "}],"characters":{"\\u067E":"p","\\u0686":"ch","\\u06A4":"v","\\u06A8":"g","\\u06AF":"g","\\u06B4":"g","\\u06AD":"g","\\b\\u0627\\u0648":"ū","\\b\\u0627\\u0648\\u0652":"aw","\\u0627\\u0648":"āw","\\b\\u0627\\u064A":"ī","\\u0627\\u064A":"āy","\\u064e":"a","\\u064e(?=\\u0629)":"","\\u064e(?=a[h|t])":"","\\u0650":"i","\\u064f":"u","\\u064e\\u0627":"ā","\\u0650\\u064a":"ī","\\u064f\\u0648":"ū","\\u064f\\u0648(?=\\u064e|u064f)":"uw","\\u064e\\u0649":"á","\\u064e\\u0649\\u0670":"á","\\u0649\\u0670":"á","\\u0652":"","\\u064e\\u064a\\u0652":"ay","(?<=\\u0644)\\u064e\\u064a":"ay","\\u064e\\u064a":"aī","\\u064e\\u0648\\u0652?(?!\\u0651)":"aw","\\u064b":"","\\u064d":"","\\u064c":"","\\u0639\\u064e":"‘a","\\u0639\\u0650":"‘i","\\u0639\\u064f":"‘ū","\\u0623":"","\\u0639\\u064f\\u0648":"‘ū","\\u0650\\u064a\\u0651\\u064e":"īy","\\u0650\\u064a(?=\\u064e|u064f)":"iy","\\u0621":"’","\\b\\u0622":"ā","\\u0622":"’ā","\\u0671":"’","\\u0626":"’","\\u0627":"ā","\\b\\u0627\\u0650\\u064a":"ī","\\b\\u0627\\u0644":"al ","\\b\\u0627\\u0644\\u062a\\u0651?":"at t","\\b\\u0627\\u0644\\u062b\\u0651?":"ath th","\\b\\u0627\\u0644\\u062f\\u0651?":"ad d","\\b\\u0627\\u0644\\u0630\\u0651?":"adh dh","\\b\\u0627\\u0644\\u0631\\u0651?":"ar r","\\b\\u0627\\u0644\\u0632\\u0651?":"az z","\\b\\u0627\\u0644\\u0633\\u0651?":"as s","\\b\\u0627\\u0644\\u0634\\u0651?":"ash sh","\\b\\u0627\\u0644\\u0635\\u0651?":"aş ş","\\b\\u0627\\u0644\\u0636\\u0651?":"aḑ ḑ","\\b\\u0627\\u0644\\u0637\\u0651?":"aţ ţ","\\b\\u0627\\u0644\\u0638\\u0651?":"az̧ z̧","\\b\\u0627\\u0644\\u0644\\u0651?":"al l","\\b\\u0627\\u0644\\u0646\\u0651?":"an n","\\u0628\\u0651":"bb","\\u062a\\u0651":"tt","\\u062b\\u0651":"thth","\\u062c\\u0651":"jj","\\u062d\\u0651":"ḩḩ","\\u062e\\u0651":"khkh","\\u062f\\u0651":"dd","\\u0630\\u0651":"dhdh","\\u0631\\u0651":"rr","\\u0632\\u0651":"zz","\\u0633\\u0651":"ss","\\u0634\\u0651":"sh","\\u0635\\u0651":"şş","\\u0636\\u0651":"ḑḑ","\\u0637\\u0651":"ţţ","\\u0638\\u0651":"z̧z̧","\\u063a\\u0651":"ghgh","\\u0641\\u0651":"ff","\\u0642\\u0651":"qq","\\u0643\\u0651":"kk","\\u0644\\u0651":"ll","\\u0645\\u0651":"mm","\\u0646\\u0651":"nn","\\u0647\\u0651":"hh","\\u0648\\u0651":"ww","\\u064a\\u0651":"yy","\\u0629":"at","\\u0629$":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{2})\\u0629":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{3})\\u0629":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{4})\\u0629":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{5})\\u0629":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{6})\\u0629":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{7})\\u0629":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{8})\\u0629":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{9})\\u0629":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{10})\\u0629":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{11})\\u0629":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{12})\\u0629":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{13})\\u0629":"ah","\\u0628":"b","\\uFE91":"b","\\uFE92":"b","\\uFE90":"b","\\u062a":"t","\\ufe97":"t","\\ufe98":"t","\\ufe96":"t","\\u062b":"th","\\ufe9b":"th","\\ufe9c":"th","\\ufe9a":"th","\\u062c":"j","\\ufe9f":"j","\\ufea0":"j","\\ufe9e":"j","\\u062d":"ḩ","\\ufea3":"ḩ","\\ufea4":"ḩ","\\ufea2":"ḩ","\\u062e":"kh","\\ufea7":"kh","\\ufea8":"kh","\\ufea6":"kh","\\u062f":"d","\\ufeaa":"d","\\u0630":"dh","\\ufeac":"dh","\\u0631":"r","\\ufeae":"r","\\u0632":"z","\\ufeb0":"z","\\u0633":"s","\\ufeb3":"s","\\ufeb4":"s","\\ufeb2":"s","\\u0634":"sh","\\ufeb7":"sh","\\ufeb8":"sh","\\ufeb6":"sh","\\u0635":"ş","\\ufebb":"ş","\\ufebc":"ş","\\ufeba":"ş","\\u0636":"ḑ","\\ufebf":"ḑ","\\ufec0":"ḑ","\\ufebe":"ḑ","\\u0637":"ţ","\\ufec3":"ţ","\\ufec4":"ţ","\\ufec2":"ţ","\\u0638":"z̧","\\ufec7":"z̧","\\ufec8":"z̧","\\ufec6":"z̧","\\u0639":"‘","\\ufecb":"‘","\\ufecc":"‘","\\ufeca":"‘","\\u063a":"gh","\\ufecf":"gh","\\ufed0":"gh","\\ufece":"gh","\\u0641":"f","\\ufed3":"f","\\ufed4":"f","\\ufed2":"f","\\u0642":"q","\\ufed7":"q","\\ufed8":"q","\\ufed6":"q","\\u0643":"k","\\ufedb":"k","\\ufedc":"k","\\ufeda":"k","\\u0644":"l","\\ufedf":"l","\\ufee0":"l","\\ufede":"l","\\u0645":"m","\\ufee3":"m","\\ufee4":"m","\\ufee2":"m","\\u0646":"n","\\ufee7":"n","\\ufee8":"n","\\ufee6":"n","\\u0647":"h","\\ufeeb":"h","\\ufeec":"h","\\ufeea":"h","\\u0648":"w","\\ufeee":"w","\\u064a":"y","\\ufef3":"y","\\ufef4":"y","\\ufef1":"y","۰":"0","۱":"1","۲":"2","۳":"3","٤":"4","٥":"5","٦":"6","۷":"7","۸":"8","۹":"9"}}}}