var map = function(Interscript) {Interscript.define_map("bgnpcgn-tat-Cyrl-Latn-2007", function(Interscript, map) {
map.dependencies = [];
map.stages.main = function(s) {
s = Interscript.gsub(s, "Г(?=[ЕеƏәИиӨөҮүЭэ])", "G");
s = Interscript.gsub(s, "г(?=[ЕеƏәИиӨөҮүЭэ])", "g");
s = Interscript.gsub(s, "К(?=[ЕеƏәИиӨөҮүЭэ])", "K");
s = Interscript.gsub(s, "к(?=[ЕеƏәИиӨөҮүЭэ])", "k");
s = Interscript.gsub(s, "Ю(?=[ЕеƏәИиӨөҮүЭэ])", "Yü");
s = Interscript.gsub(s, "ю(?=[ЕеƏәИиӨөҮүЭэ])", "yü");
s = Interscript.gsub(s, "Я(?=[ЕеƏәИиӨөҮүЭэ])", "Yä");
s = Interscript.gsub(s, "я(?=[ЕеƏәИиӨөҮүЭэ])", "yä");
s = Interscript.gsub(s, "(?<=[АаЕеƏәОоӨөҮүУуЫыЭэЯяЪъЬь])Е", "Yı");
s = Interscript.gsub(s, "(?<=[АаЕеƏәОоӨөҮүУуЫыЭэЯяЪъЬь])е", "yı");
s = Interscript.gsub(s, "(?<=[АаЕеƏәИиОоӨөҮүУуЫыЭэЮюЯяЪъЬь])У", "W");
s = Interscript.gsub(s, "(?<=[АаЕеƏәИиОоӨөҮүУуЫыЭэЮюЯяЪъЬь])у", "w");
s = Interscript.gsub(s, "(?<=[АаЕеƏәИиОоӨөҮүУуЫыЭэЮюЯяЪъЬь])Ү", "W");
s = Interscript.gsub(s, "(?<=[АаЕеƏәИиОоӨөҮүУуЫыЭэЮюЯяЪъЬь])ү", "w");
s = Interscript.gsub(s, "(?<=[Гг])ый", "i");
s = Interscript.gsub(s, "(?<=[Ии])Ю", "Ü");
s = Interscript.gsub(s, "(?<=[Ии])ю", "ü");
s = Interscript.gsub(s, "(?<=[Ии])Я", "Ä");
s = Interscript.gsub(s, "(?<=[Ии])я", "ä");
s = Interscript.parallel_replace_tree(s, map.cache.PTREE_1368717271857979780);
return s;
};
map.cache.PTREE_1368717271857979780 = {"1040":{"":"A"},"1240":{"":"Ə"},"1041":{"":"B"},"1042":{"":"W"},"1043":{"":"Ğ"},"1044":{"":"D"},"1045":{"":"E"},"1046":{"":"J"},"1174":{"":"C"},"1047":{"":"Z"},"1048":{"":"İ"},"1049":{"":"Y"},"1050":{"":"Q"},"1051":{"":"L"},"1052":{"":"M"},"1053":{"":"N"},"1186":{"":"Ꞑ"},"1054":{"":"O"},"1256":{"":"O"},"1055":{"":"P"},"1056":{"":"R"},"1057":{"":"S"},"1058":{"":"T"},"1059":{"":"U"},"1198":{"":"Ü"},"1060":{"":"F"},"1061":{"":"Х"},"1210":{"":"H"},"1062":{"":"Ts"},"1063":{"":"Ç"},"1064":{"":"Ş"},"1065":{"":"ŞÇ"},"1066":{"":""},"1067":{"":"I"},"1068":{"":"’"},"1069":{"":"E"},"1070":{"":"Yu"},"1071":{"":"Ya"},"1072":{"":"a"},"1241":{"":"ə"},"1073":{"":"b"},"1074":{"":"w"},"1075":{"":"ğ"},"1076":{"":"d"},"1077":{"":"e"},"1078":{"":"j"},"1175":{"":"c"},"1079":{"":"z"},"1080":{"":"i"},"1081":{"":"y"},"1082":{"":"q"},"1083":{"":"l"},"1084":{"":"m"},"1085":{"":"n"},"1187":{"":"ꞑ"},"1086":{"":"o"},"1257":{"":"o"},"1087":{"":"p"},"1088":{"":"r"},"1089":{"":"s"},"1090":{"":"t"},"1091":{"":"u"},"1199":{"":"ü"},"1092":{"":"f"},"1093":{"":"x"},"1211":{"":"h"},"1094":{"":"ts"},"1095":{"":"ç"},"1096":{"":"ş"},"1097":{"":"şç"},"1098":{"":""},"1099":{"":"ı"},"1100":{"":"’"},"1101":{"":"e"},"1102":{"":"yu"},"1103":{"":"ya"}};
});};if (typeof module !== 'undefined') { module.exports = map; }else if (typeof Interscript !== 'undefined') { map(Interscript); }else { throw "We couldn't dispatch Interscript from a map!"; }