{"bgnpcgn-aze-Cyrl-Latn-1993":{"authority_id":"bgnpcgn","id":1993,"language":"iso-639-2:aze","source_script":"Cyrl","destination_script":"Latn","name":"AZERBAIJANI TABLE OF CORRESPONDENCES CYRILLIC-ROMAN -- BGN/PCGN 1993 Agreement","url":"https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/816656/TABLE_OF_CORRESPONDENCES_FOR_AZERBAIJANI.pdf","creation_date":1993,"confirmation date":"2019-06","description":"Azerbaijani, also known as Azeri, is the official language of the Republic of Azerbaijan. In 1991, the Azerbaijani government adopted the Roman alphabet to replace the existing Cyrillic alphabet. The presentation below provides a table of correspondences between the former Cyrillic alphabet and the current Roman alphabet. When Azerbaijani Roman-alphabet spellings are not available, this table can be used to convert Azerbaijani Cyrillic spellings.\n","notes":["The special letter Ə, ə known as schwa, should be reproduced in that form whenever encountered. The characters Ə (Unicode 04D8) and ə (Unicode 04D9) should be used for schwa when writing in the Cyrillic script, but characters Ə (Unicode 018F) and ə (Unicode 0259) should be used when writing in the Roman alphabet. In those instances when it cannot be reproduced, however, the letter Ä ä may be substituted for it (see below).","The obsolete characters й, э, ю, and я should be romanized ẏ, ė, yu., and ya.","Unicode values are shown with the uppercase Cyrillic character first, followed by the lowercase character. It is not known whether there exists an uppercase ‘J’ specific to the Cyrillic character set.","An inventory of letter-diacritic combinations, with their Unicode encoding, in addition to the unmodified letters of the basic Roman script is:\nĞ (U+011E), ğ (U+011F)\nƏ (U+018F), ə (U+0259)\nİ (U+0130), ı (U+0131)\nÖ (U+00D6), ö (U+00F6)\nÜ (U+00DC), ü (U+00FC)\nÇ (U+00C7), ç (U+00E7)\nŞ (U+015E), ş (U+015F)\n","The Roman-script columns show only lowercase forms but, when applying the table, uppercase and lowercase Roman letters as appropriate should be used."],"tests":[{"source":"Азәрбајҹан әлифбасы","expected":"Azərbaycan əlifbası"},{"source":"Бүтүн инсанлар ләјагәт вә һүгугларына ҝөрә азад бәрабәр доғулурлар.\nОнларын шүурлары вә виҹданлары вар вә бир-бирләринә мүнасибәтдә гардашлыг руһунда давранмалыдырлар.\n","expected":"Bütün insanlar ləyaqət və hüquqlarına görə azad bərabər doğulurlar.\nOnların şüurları və vicdanları var və bir-birlərinə münasibətdə qardaşlıq ruhunda davranmalıdırlar.\n"}],"map":{"characters":{"А":"A","Б":"B","В":"V","Г":"Q","Ғ":"Ğ","Д":"D","Е":"E","Ә":"Ə","Ж":"J","З":"Z","И":"İ","Ы":"I","Ј":"Y","К":"K","Ҝ":"G","Л":"L","М":"M","Н":"N","О":"O","Ө":"Ö","П":"P","Р":"R","С":"S","Т":"T","У":"U","Ү":"Ü","Ф":"F","Х":"X","Һ":"H","Ч":"Ç","Ҹ":"C","Ш":"Ş","а":"a","б":"b","в":"v","г":"q","ғ":"ğ","д":"d","е":"e","ә":"ə","ж":"j","з":"z","и":"i","ы":"ı","ј":"y","к":"k","ҝ":"g","л":"l","м":"m","н":"n","о":"o","ө":"ö","п":"p","р":"r","с":"s","т":"t","у":"u","ү":"ü","ф":"f","х":"x","һ":"h","ч":"ç","ҹ":"c","ш":"ş"}}}}