{"bgnpcgn-prs-Arab-Latn-yaghoubi":{"authority_id":"bgnpcgn","id":"yaghoubi","language":"iso-639-3:prs","source_script":"Arab","destination_script":"Latn","name":"BGN/PCGN NATIONAL ROMANIZATION SYSTEM FOR AFGHANISTAN -- BGN/PCGN 2007 System (Yaghoubi)","url":"https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/693661/ROMANIZATION_FOR_AFGHANISTAN.pdf","creation_date":2007,"confirmation_date":"2017-11","description":"This romanization system agreed by BGN and PCGN in November 2007,\naccommodates the linguistic complexity of Afghanistan as manifest in\nits geographical names.\n\nThe following tabulation shows the original Perso-Arabic script with\naccompanying Unicode value (columns 1a and b), the Yaghoubi\nromanization (column 2), the BGN/PCGN romanization with accompanying\nUnicode value (columns 3a and b), an English phonetic example (column\n4), and an example toponym (columns 5b and c).\n\n[The Yaghoubi romanization system was developed in 1959 by\nMuzaffarud Din Yaqubi (commonly seen as Yaghoubi). It is a native\nofficial system designed to reflect Afghan names, both Dari and Pashto,\nand both pronunciation and genuine linguistic truth.]\n\nThe tables function as both a romanization system for Afghanistan (i.e.\nwith access to the original script, these tables can be applied to get\na standardized Roman result - moving from columns 1 to 3) and as a\nmeans of converting the available Yaghoubi Roman-script spellings, as\nappear on the Fairchild Aerial Surveys map series, to standard BGN/PCGN\nspellings (moving from columns 2 to 3).\n\nThe points used in Arabic to mark short vowels and certain other\ndiacritical marks are infrequently written in Afghanistan.\nConsequently, a reference source may sometimes be required to aid\ncorrect identification of the standard spellings and proper vowels and\nelimination of dialectal and idiosyncratic variations. In the interests\nof clarity, the example columns show script with vowel pointing from\nArabic to indicate the short vowels that are included alongside the\nunpointed form that will usually be encountered. However it should be\nnoted that the pronunciation of short vowels will vary.\n\nNote: it is recommended that a font such as Scheherazade, available\nfrom www.sil.org, which includes the Unicode extended Arabic sub-range,\nbe used to view this system. [Please note that the identification of a\nparticular font does not represent an endorsement of any specific\nproduct or manufacturer.]\n","notes":["Alif (ا) should be romanized as follows:\n\na. Initially, it indicates that the word begins with a vowel or\n  diphthong; the alif itself is not romanized, but rather the short vowel\n  it “carr es” is romanized; e.g., ميړ أَسَلم ژرَندَه → Mī Aslam Zhrandah\nb. When it carries a maddah (آ) (see vowel table, row 6), it\n  represents ā; e.g., آب بَند → Āb Band.\nc. Medially and finally it represents ā (see vowel table, row 5);\n  e.g., ماڼۍ → Māṉêy\nd. Medially and finally in words of Arabic origin, alif may serve\n  as the bearer of hamzah, e.g. رأس → ra’s.\n","Occasionally the letter sequences سه ,زه ,که, and گه occur without intervening vowels. They may be romanized k·h, z·h, s·h, and g·h in order to differentiate these romanizations from the digraphs kh, zh, sh, and gh, which are used to represent the letters ش ,ژ ,خ, and غ. Additionally, the Pashto letters څ and ځ, routinely romanized ts and dz, may be alternatively romanized s and z تس when for special reasons it is desired that confusion be avoided with the character sequences (ts) and دز (dz), respectively.","The vagaries of written Afghan languages, as pertains to spacing and word division, are addressed as follows: Spaces may be added to or subtracted from Afghan words written in Arabic script, for the purposes of standardization. This is particularly relevant when the words are hand-written, are rendered “art st cally”, or express other s ch non-standard flourishes, as long as the sense of the toponym, word, or phrase is not compromised. Romanized toponyms are typically divided into constituent words (spaces and other grammatical rules applied) when those words can stand independently, for purposes of standardization and minimization of confusion, particularly in situations where Afghan writers are inconsistent in their application of spacing and word breaks. When the Afghan word or suffix is only used in combination with other nouns or adjectives, then it should be appended to the preceding word in its romanization. This includes (but is not limited to) - ābā , -zaī, -zā ah, - ū, -wand, -gaī, -kaī, -pūr, - ēsh, -lar, -lī, -lū and ullāh, as, for example, seen in Raḩmatābād (رحمت آباد) and Raḩmatullāh (رحمت االله), but Raḩmat Khēl (رحمتخيل) and Raḩmat Shahr (رحمتشهر).","The one-letter words د (Pashto) and و (Dari) are romanized dê and wa, respectively.","The word الله, meaning God, should always be romanized Allāh, except as specified in note 3. Note that the Unicode value FDF2 spells Allāh, but omits the alif in some common fonts, including Times New Roman. If in doubt, try in Arial Unicode MS to verify. Also note that the “dagger al f” ( ) above the second ل (lām) n the ord الله, is not written but should be romanized ā, like a full-size alif.","In names of Arabic origin, the l of the definite article al s ass m lated before the ‘s n letters’ , , , , r, z, s, sh, ş, ẕ, , z, l and n. In its romanization, the article should be separated from the name it precedes and should not be capitalized except at the beginning of a name, e.g. جبل السراج→ Jabal as Sarāj","In Arabic names, a shaddah, ّ is used to denote the doubling of a particular consonant character, e.g. ُم َح َمد → Muḩammad. Ho ever, n Pashto th s ‘do bl ng’ s freq ently om tted n both Perso- Arabic script and the resulting romanization. Guidance on doubling may be taken from an authoritative names source, such as an Afghan government source or Pashto dictionary; for example, it is usual to see Ḩājī without and ‘Abbās with the doubled consonant. The doubled y consonant is almost always retained, as in Sayyid or Qayyūm.","In Afghan names which contain an iẕāfah, it should be romanized as -e or –ye according to common pronunciation, but generally, -e is used if the preceding word ends with a consonant other than silent heh, and -ye if the preceding word ends with a vowel sound e.g. غر ِحصار → Ghar-e ِ Ḩ şār; َقل َع ٔه َنو → Qal‘ah-ye Now. Scholarly sources indicate that heh is silent in darah and qal‘ah (thus darah-ye, qal‘ah-ye), but lightly spoken in kōh and chāh (thus kōh-e, chāh-e).","The character sequence خو, where followed by ا or ی should be romanized khwā or khwī, although the w is either not pronounced, or only weakly so, as in خواجه → khwājah.","Plural nouns ending in -hā or -ān should always be romanized as a single word, regardless of whether a space appears in a Perso-Arabic script source.","Unicode values listed in the tables above are required to ensure standardization and to minimize confusion from competing representations of a given character. It should be noted that the Persian Unicode value 0643 or FEDA( ك Unicode value 06A9) is recommended rather than the Arabic( ک or FED9), the Persian گ (Unicode value 06AF) is recommended rather than ګ (Unicode value 06AB) or ڰ (Unicode value 06B0) or ك (Unicode value 0643 or FEDA or FED9), and the Pashto character ځ (Unicode value 0681) is recommended rather than the heh with a dot above and a dot below (no Unicode value). For the letter ی in its many variations, care must be exercised to follow this romanization guide's recommendations to eliminate confusion for search engines and software. BGN/PCGN does not use the Unicode encoding FEEF for the character ی in any Afghan word.","An inventory of letter-diacritic combinations in addition to the\nunmodified letters of the basic Roman script is:\n\n  ‘ (U+2018)\n  Ā (U+0100)\n  Á (U+00C1)\n  Ḏ (U+0044+0031)\n  Ē (U+9112)\n  Ê (U+00CA)\n  Ḩ (U+1E28)\n  Ī (U+012A)\n  N-bar-top (U+004E+0304)\n  Ō (U+014C)\n  R-bar-bottom (U+0052+0031)\n  Ş (U+015E)\n  S-bar-top (U+0053+0304)\n  Ṯ (U+0054+0031)\n  Ţ (U+0162)\n  Ū (U+918A)\n  Z-comma-bottom (U+005A+0327)\n  Z-bar-top (U+005A+0304)\n  Ẕ (U+005A+0331)\n  ẔH (U+005A+0048+035F)\n\n\n  ʼ (U+2019)\n  ā (U+0101)\n  á (U+00E1)\n  ḏ (U+0064+00031)\n  ē (U+0113)\n  ê (U+00EA)\n  ḩ (U+1E29)\n  ī (U+912B)\n  n-bar-top (U+004E+0304)\n  ō (U+014D)\n  r-bar-bottom (U+0072+0031)\n  ş (U+015F)\n  s-bar-top (U+0073+0304)\n  ṯ (U+0074+0031)\n  ţ (U+0163)\n  ū (U+918B)\n  z-comma-bottom (U+007A+0327)\n  z-bar-top (U+007A+0304)\n  ẕ (U+007A+0331)\n  zh-under-bar (U+007A+0068+035F)\n","The Romanization columns show only lowercase forms but, when romanizing, uppercase and lowercase Roman letters as appropriate should be used."],"tests":[{"source":"بَغْلَان","expected":"baghlān"},{"source":"پُوټَكَى","expected":"pōtakay"},{"source":"شِيرِين تَگَاب","expected":"šīṟīn t̄agāb"},{"source":"کُوْټ","expected":"kōt"},{"source":"ثَابِر","expected":"s̄ābiṟ"},{"source":"جَبَل السَرَاج","expected":"jabal as saṟāj"}],"map":{"characters":{"\\u06CC":"i","\\u06D0":"ē","\\u06CD":"əy","\\u0621":"’","\\u0674":"-e","\\u0627":"ā","\\u0648":"w","\\u06C0":". . .h-e","\\s(?=\\u0622\\u0628\\u064E\\u0627\\u062F)":"","\\ufdf2":"Allāh","\\u064E":["a","â"],"\\u064e(?=\\u0629)":"","\\u064e(?=a[h|t])":"","\\u0650":["i","e"],"\\u0650\\b":"-e","\\u064f":["u","o"],"\\u064e\\u0627":"ā","\\u0622":"ā","\\u0659":["ə","ê"],"\\u064e\\u0648":"ow","\\u0649\\u0670":"ā","\\u0652":"","\\u0639\\u064e":"‘a","\\u0639\\u0650":"‘i","\\u0639\\u064f":"‘ū","\\u0639\\u064f\\u0648":"‘ū","\\u0650\\u064a":"ī","\\u0650\\u06cc":"ī","\\u0650\\u064a\\u0651\\u064e":"īy","\\u0650\\u064a(?=\\u064e|u064f)":"iy","\\u064f\\u0648":"ō","\\u064e\\u0649":"ay","\\u064e\\u0648\\u0652":"aw","\\u064e\\u064a\\u0652":"ay","\\u0650\\u06cc\\u0651\\u064e":"īy","\\u064e\\u064a":"aī","\\u064e\\u06cc":"aī","\\u0654":"-e","\\u0629":"at","\\u0629$":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{2})\\u0629":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{3})\\u0629":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{4})\\u0629":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{5})\\u0629":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{6})\\u0629":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{7})\\u0629":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{8})\\u0629":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{9})\\u0629":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{10})\\u0629":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{11})\\u0629":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{12})\\u0629":"ah","(?<=\\b\\u0627\\u0644[\\u0600-\\u06ff]{13})\\u0629":"ah","\\u0628\\u0651":"bb","\\u062a\\u0651":"tt","\\u062b\\u0651":"thth","\\u062c\\u0651":"jj","\\u062d\\u0651":"ẖẖ","\\u062e\\u0651":"khkh","\\u062f\\u0651":"dd","\\u0630\\u0651":"z̄z̄","\\u0631\\u0651":"rr","\\u0632\\u0651":"zz","\\u0633\\u0651":"ss","\\u0634\\u0651":"sh","\\u0635\\u0651":"şş","\\u0636\\u0651":"ḏḏ","\\u0637\\u0651":"ţţ","\\u0638\\u0651":"z̧z̧","\\u063a\\u0651":"ghgh","\\u0641\\u0651":"ff","\\u0642\\u0651":"qq","\\u0643\\u0651":"kk","\\u0644\\u0651":"ll","\\u0645\\u0651":"mm","\\u0646\\u0651":"nn","\\u0647\\u0651":"hh","\\u0648\\u0651":"ww","\\u064a\\u0651":"yy","\\u0626":"’","\\u0623":"","\\u0625":"","\\b\\u0627\\u0644":"al ","\\b\\u0627\\u0644\\u062a":"at̄ t̄","\\b\\u0627\\u0644\\u062b":"as̄ s̄","\\b\\u0627\\u0644\\u062f":"aḏ ḏ","\\b\\u0627\\u0644\\u0630":"az̄ z̄","\\b\\u0627\\u0644\\u0631":"aṟ ṟ","\\b\\u0627\\u0644\\u0632":"az z","\\b\\u0627\\u0644\\u0633":"as s","\\b\\u0627\\u0644\\u0634":"aš š","\\b\\u0627\\u0644\\u0635":"as̱ s̱","\\b\\u0627\\u0644\\u0636":"ad͟z d͟z","\\b\\u0627\\u0644\\u0637":"aṯ ṯ","\\b\\u0627\\u0644\\u0638":"aẕ ẕ","\\b\\u0627\\u0644\\u0644":"al l","\\b\\u0627\\u0644\\u0646":"an n","\\u0628":"b","\\u067E":"p","\\u062A":"t̄","\\u067C":"t","\\u062B":"s̄","\\u062C":"j","\\u0686":"č","\\u0681":"j̄","\\u0685":"c","\\u062D":"ẖ","\\u062E":"kh","\\u062F":"ḏ","\\u0689":"d","\\u0630":"z̄","\\u0631":"ṟ","\\u0693":"r","\\u0632":"z","\\u0698":"ž","\\u0696":"ž̲","\\u0633":"s","\\u0634":"š","\\u069A":"š̱","\\u0635":"s̱","\\u0636":"d͟z","\\u0637":"ṯ","\\u0638":"ẕ","\\u0639":"’","\\u063A":"gh","\\u0641":"f","\\u0642":"q","\\u0643":"k","\\u06A9":"k","\\u06AF":"g","\\u0644":"l","\\u0645":"m","\\u0646":"n","\\u06BC":"ṉ","\\u0647":"h","\\u0649":"y","\\u064a":"y"}}}}