var map = function(Interscript) {Interscript.define_map("bis-tml-Taml-Latn-13194-1991", function(Interscript, map) {
map.dependencies = [];
map.stages.main = function(s) {
s = Interscript.gsub(s, "ஂ(?=[கங])", "ṅ");
s = Interscript.gsub(s, "ஂ(?=[சஜஞ])", "ñ");
s = Interscript.gsub(s, "ஂ(?=[டண])", "ṇ");
s = Interscript.gsub(s, "ஂ(?=[தநன])", "n");
s = Interscript.gsub(s, "ஂ(?=[பம])", "m");
s = Interscript.parallel_replace_tree(s, map.cache.PTREE_315291432149449475);
s = Interscript.functions.compose(s, {});
return s;
};
map.cache.PTREE_315291432149449475 = {"2949":{"":"a"},"2950":{"":"ā"},"2951":{"":"i"},"2952":{"":"ī"},"2953":{"":"u"},"2954":{"":"ū"},"2958":{"":"e"},"2959":{"":"ē"},"2960":{"":"ai"},"2962":{"":"o"},"2963":{"":"ŏ"},"2964":{"":"au"},"2965":{"":"k"},"2969":{"":"ṅ"},"2970":{"":"c"},"2972":{"":"j"},"2974":{"":"ñ"},"2975":{"":"ṭ"},"2979":{"":"ṇ"},"2980":{"":"t"},"2984":{"":"n"},"2985":{"":"ṉ"},"2986":{"":"p"},"2990":{"":"m"},"2991":{"":"y"},"2992":{"":"r"},"2993":{"":"ṟ"},"2994":{"":"l"},"2995":{"":"ḷ"},"2996":{"":"ẕ"},"2997":{"":"v"},"2998":{"":"ś"},"2999":{"":"ṣ"},"3000":{"":"s"},"3001":{"":"h"},"2947":{"":"ḥ"},"2946":{"":"ṃ"},"3006":{"":"ā"},"3007":{"":"i"},"3008":{"":"ī"},"3009":{"":"u"},"3010":{"":"ū"},"3395":{"":"ṛ"},"3396":{"":"ṝ"},"3014":{"":"e"},"3015":{"":"ē"},"3016":{"":"ai"},"3018":{"":"o"},"3019":{"":"ō"},"3020":{"":"au"},"3450":{"":"n"},"3451":{"":"ṇ"},"2381":{"":""},"3405":{"":""},"3021":{"":""},"3415":{"":""},"8205":{"":""},"8204":{"":""}};
});};if (typeof module !== 'undefined') { module.exports = map; }else if (typeof Interscript !== 'undefined') { map(Interscript); }else { throw "We couldn't dispatch Interscript from a map!"; }