{"odni-urd-Arab-Latn-2015":{"authority_id":"odni","id":2015,"language":"iso-639-2:urd","source_script":"Arab","destination_script":"Latn","name":"Office of the Director Of National Intelligence Hindi Urdu Personal Names 2015 System, ICS-630-01 Annex F","creation_date":2015,"confirmation_date":2015,"description":"This system is the Intelligence Community (IC) standard for the transliteration of names\nfrom Hindi and Urdu that will be applied to all final written reports and products for IC\nconsumers. It is not intended to eliminate variations of a name that can contribute\nforensic information. Rather, it is to provide an IC standard Romanized (English)\ntransliteration from standard Hindi and Urdu that can then be linked to forensic\ninformation in ways that will help identify the referent of the name.\n\nThere are typically a number of ways that names can be Romanized from either\nDevanagari (Hindi) or modified Arabic (Urdu) scripts. Ambiguities can result from the\nRomanization of Hindi and Urdu names for several reasons, including the fact that some\nsounds in South Asian languages (e.g., retroflex consonants, voiced aspirates) have no\nequivalent in English or other European languages. In the case of Urdu, as in the original\nArabic source of many Islamic names, short vowel markings, double consonant marks\nand other diacritics that would clearly distinguish the name are almost always omitted\nfrom standard written texts. And many Islamic names of Arabic or Persian origin reflect\nspelling distinctions from those languages that are lost in modern Urdu pronunciation\n(e.g., three distinct Arabic letters all represent the identical sound [s] for Urdu speakers);\ntransliterations might either maintain those spelling distinctions or ignore them entirely.\nAnd, as in the Arabic source, names containing the Arabic definite article ‘al’ (‘ul’) show\nanticipatory assimilation in pronunciation (e.g., Shams al Din > Shamsuddin);\ntransliterations may either reflect spelling or pronunciation in such cases.\n\nBecause Hindi and Urdu overlap so extensively, it is desirable to correlate Hindi and\nUrdu transliterations as much as possible. In the area of names, this can become\nproblematic when the Urdu spelling accurately reflects original Arabic spelling while the\nHindi spelling was phonetically-based, in essence, already a transliteration. This would\nargue for ignoring Arabic/Urdu spelling distinctions not reflected in pronunciation in\neither Urdu or Hindi (e.g., letter sin versus letter sad) while maintaining Arabic/Urdu\nspelling distinctions like Hindi also maintains (e.g., qaf as in Qutubbin versus kaf)).\nHowever, this is not always possible (see Hindi va versus Urdu wau).\n\nIn cases where an individual’s name has already been transliterated, that is to be indicated\n– as found – in parentheses immediately following its rendition in the transliteration\nstandard (e.g., Muhammad Khulud (Mohamed Khulood)). In addition, if the original\nDevanagari or Arabic-script spelling is known, that spelling should also appear in\nparentheses following the name, if possible, following best practices of the issuing\norganization and taking into consideration information system capabilities. This\nconvention is designed to ensure that vital forensic information is not lost.\n\nFor names of persons who are known to not be part of the Hindi- or Urdu-speaking\ncommunity, use the relevant IC transliteration standard for names from that language\n(e.g., Mikhail, Yitzhak). A translator’s note may be used to clarify the known origin of\nthe person. Spell names of individuals from languages that are written in Roman letters as\nthey are spelled in those languages (e.g., George Clooney, Jorge Garcia, Georges\nPompidou).\n\nIn the case of active senior government officials in the on-line CIA World Factbook and\nthe on-line directory of Chiefs of State and Cabinet Members of Foreign Governments,\nthe spellings given in these on-line reference works should be used in place of the IC\nStandard. For any individual who has at one time been listed in the Factbook or Chiefs of\nState directory but who no longer appears in those resources (i.e. is no longer a\ngovernment official), the IC Standard spelling should appear first, with the spelling, if\nknown, as it previously appeared in those resources listed within parentheses at the first\nusage.\n\nThe primary goal of this system is to produce a consistent Romanized transcription of the\nname that is readable to the non-specialist. The system uses the 26 letters of the standard\n(English) Roman alphabet. Some ambiguities in the Romanized form will occur without\nthe use of diacritics. However, within the context of a report, where additional\ninformation about the individual is provided, the referent will be clearly identified.\nAdditionally, this system will be used in conjunction with on-line tools, name dictionaries\nand lists containing conventional spellings of names of well-known individuals\n","notes":["Long/Short Vowels: Long and short vowels are not distinguished in the system:\nThe borrowed Arabic name Samir could represent two distinct names, one with a\nlong /a/ (Saamir) and one with a long /i/ (Samiir). One solution would be to use\n/ee/ to stand for the long /i/, as is often done (Sameer). The IC Standard will not\ndistinguish between these.\n","No distinction is made between: retroflex and non-retroflex consonants; and\nnasalized vowels and vowels followed by /n/.\n","No distinction is made between the several Arabic letters with the same phonetic\nvalue in Urdu: e.g., letters sin/svad, zal/ze/zoe.\n","A distinction is drawn between Urdu letters qaf and kaf (and correspondingly,\nHindi qa and ka).\n","A distinction is drawn between aspirated (e.g., /d/) and nonaspirated consonants\n(e.g., /dh/), with the exception of ch/chh, both represented by /ch/.\n","Double consonants: Double consonants represented by the tashdid (shaddah) are\nshown in most cases (e.g., Hassan, Muhammad). Exceptions: consonants\nrepresented by digraphs are not doubled (e.g., Mubashir [not Mubashshir]).\n","Hamzah (glottal stop) and ayn: Unlike in the Arabic IC Standard, these are not\nrepresented in the IC standard.\n","Digraphs: No distinction is made between digraphs such as /sh/ and single\ncontiguous letters such as /s/ followed by /h/.\n","Arabic definite article “al” (‘the’): Shows sun letter assimilation in the\nRomanized form (e.g., Abdur Rahman rather than Abdal Rahman, rather than\nArabic IC standard 'Abd al-Rahman).\n","Special Rules\n- |\n  Hyphens: Hyphens (-) are NOT used to connect name elements within a name:\n  Abdur Rahman. The single exception to this is the izafat (i.e., linking vowel in\n  noun-link-modifier construction of Persian origin), which does show a hyphen\n  before the /e/ and a following space: Koh-e Nur (‘mountain of light’), “Jaish-e\n  xx” (‘Army of xx’ construction).\n- |\n  Names incorporating “din” are written as one unit: Azermuddin, Badruddin,\nFaizuddin, Salahuddin.\n- |\n  Names that incorporate Allah as part of the name show the Arabic grammatical\n  marker /u/ rather than the /a/ of Allah: Abdullah (not Abdallah).\n- |\n  Inherent short vowel /a/ in Devanagari is represented with an /a/ in Roman. Final\n  consonants are assumed not to have a short /a/ (e.g., masc. name Ram Lal, not\n  Rama Lala).\n- |\n  As a general rule, Devanagari va is transcribed as a /v/: Vijay, Vishal, etc.\n  Exception: /sw/ combination: Saraswati, Krishnaswami. Urdu wau, however, is\n  transcribed as /w/: Wasim, Walid.\n"],"tests":[{"source":"وشال ٹھاکر","expected":"ishal tsakr"},{"source":"حسن محمود","expected":"hasn mhamid"},{"source":"یوسف خان","expected":"iisf khan"},{"source":"معین خان","expected":"mein khan"},{"source":"سعید اجمل","expected":"seid ajml"},{"source":"انضمام الحق","expected":"anzmam alhaq"},{"source":"فرہاد رضا","expected":"frahad rza"},{"source":"وسیم اکرام","expected":"isim akram"},{"source":"شکیب الحسن","expected":"shkib alhasn"},{"source":"حسن عبد اللہ","expected":"hasn ebd allah"}],"map":{"characters":{"\\u0622":"a","\\u0627":"a","\\u06cc":"i","\\u0648":"i","\\u06d2":"e","\\u0650":"e","\\u0639":"e","\\u06c1":"ah","\\u062d":"ha","\\u0648\\u0670":"a","\\u0670":"a","\\u0627\\u0650":"i","\\u0639\\u0650":"i","\\u064f":"i","\\u06d3":"i","\\u06c2":"-e","\\u06c1\\u0650":"o","\\u0624":"au","\\u06a9":"k","\\u0642":"q","\\u062e":"kh","\\u06af":"g","\\u063a":"gh","\\u0686":"ch","\\u062c":"j","\\u0632":"z","\\u0630":"z","\\u0636":"z","\\u0638":"z","\\u0698":"zh","\\u0679":"t","\\u0688":"d","\\u062f":"d","\\u0691":"r","\\u062a":"t","\\u0637":"t","\\u0646":"n","\\u06ba":"n","\\u067e":"p","\\u0641":"f","\\u0628":"b","\\u0645":"m","\\u0631":"r","\\u0644":"l","\\u0634":"sh","\\u0633":"s","\\u062b":"s","\\u0635":"s","\\u0621":"","\\u06be":"s","\\u064b":"n","\\u064e":"n","\\u0652":"","\\u0651":""}}}}