{"odni-uig-Cyrl-Latn-2015":{"authority_id":"odni","id":2015,"language":"iso-639-2:uig","source_script":"Cyrl","destination_script":"Latn","name":"Standards for the transliteration of uyghur personal names in written reports and products","source":"ICS-630-01 Annex U","creation_date":2015,"confirmation_date":2015,"description":"This system is the Intelligence Community standard for the transliteration of Uyghur person names\nthat will be applied to all final written reports and products for IC consumers. It is not\nintended to eliminate variations of a name that can contribute forensic information. Rather, it is\nto provide an IC standard Romanized (English) transliteration from Uyghur that can then be linked\nto forensic information in ways that will help identify the referent of the name.\n\nIn cases where an individual’s name has already been transliterated in a variant spelling, the IC\nStandard spelling should appear first, followed by the variant spelling(s) in parentheses at the\nfirst usage. In addition, if the original Cyrillic-script or Arabic-script spelling is known, that\nspelling should also appear in parentheses following the name, if possible, following best\npractices of the issuing organization and taking into consideration information system capabilities.\nFor example: Zordun Sabir (also seen as Zordun Sabeer, Зордун Сабир ,زوردون سابیر). This convention\nis designed to ensure that vital forensic information is not lost.\n\nFor names of persons who are known to not be part of the Uyghur-speaking community, use the relevant\nIC transliteration standard for names from that language (e.g., Yitzhak). A translator’s note may be\nused to clarify the known origin of the person. Spell names of individuals from languages that are\nwritten in Roman letters as they are spelled in those languages (e.g., George Clooney, Jorge Garcia,\nGeorges Pompidou).\n\nIn the case of active senior government officials in the on-line CIA World Factbook and the on-line\ndirectory of Chiefs of State and Cabinet Members of Foreign Governments, the spellings given in\nthese on-line reference works should be used in place of the IC Standard. For any individual who has\nat one time been listed in the Factbook or Chiefs of State directory but who no longer appears in\nthose resources (i.e. is no longer a government official), the IC Standard spelling should appear\nfirst, with the spelling, if known, as it previously appeared in those resources listed within\nparentheses at the first usage.\n\nThe primary goal is to produce a consistent Romanized transcription of names that is specifically\nreadable to the English-speaking non-specialist. The system uses the 26 letters of the standard\n(English) Roman alphabet. Some ambiguities in the Romanized form will occur without the use of\ndiacritics. However, within the context of a report, where additional information about the\nindividual is provided, the referent will be clearly identified. This system will be used in\nconjunction with on-line tools, name dictionaries, and lists containing conventional spellings of\nnames of well-known individuals.\n","notes":["Transliterate double digraphs as a single digraph, i.e. шш -> sh, not shsh","In the Roman, no distinction is made between digraphs such as 'sh' and single contiguous letters, (e.g. 's' followed by 'h').","The Cyrillic ъ and ь are not transliterated, but instead are left out of the transliteration."],"tests":[{"source":"Зордун Сабир","expected":"Zordun Sabir"}],"map":{"rules":[{"pattern":"(?i)(Ғ|Ё|Җ|Ң|Ч|Ш|Ю|Я)\\1(?-i)","result":"\\1"},{"pattern":"\\u044A|\\u044C","result":""}],"characters":{"\\u0410":"A","\\u04D8":"E","\\u0411":"B","\\u0412":"W","\\u0413":"G","\\u0492":"Gh","\\u0414":"D","\\u0415":"E","\\u0401":"Yo","\\u0416":"J","\\u0496":"Zh","\\u0417":"Z","\\u0418":"I","\\u0419":"Y","\\u041A":"K","\\u049A":"Q","\\u041B":"L","\\u041C":"M","\\u041D":"N","\\u04A2":"Ng","\\u041E":"O","\\u04E8":"O","\\u041F":"P","\\u0420":"R","\\u0421":"S","\\u0422":"T","\\u0423":"U","\\u04AE":"U","\\u0424":"F","\\u0425":"X","\\u04BA":"H","\\u0427":"Ch","\\u0428":"Sh","\\u042E":"Yu","\\u042F":"Ya","\\u0430":"a","\\u04D9":"e","\\u0431":"b","\\u0432":"w","\\u0433":"g","\\u0493":"gh","\\u0434":"d","\\u0435":"e","\\u0451":"yo","\\u0436":"j","\\u0497":"zh","\\u0437":"z","\\u0438":"i","\\u0439":"y","\\u043A":"k","\\u049B":"q","\\u043B":"l","\\u043C":"m","\\u043D":"n","\\u04A3":"ng","\\u043E":"o","\\u04E9":"o","\\u043F":"p","\\u0440":"r","\\u0441":"s","\\u0442":"t","\\u0443":"u","\\u04AF":"u","\\u0444":"f","\\u0445":"x","\\u04BB":"h","\\u0447":"ch","\\u0448":"sh","\\u044E":"yu","\\u044F":"ya"}}}}