{"odni-rus-Cyrl-Latn-2015":{"authority_id":"odni","id":2015,"language":"iso-639-2:rus","source_script":"Cyrl","destination_script":"Latn","name":"Office of the Director Of National Intelligence Russian Personal Names 2015, ICS-630-01 Annex K","source":"ICS-630-01 Annex K","creation_date":2015,"confirmation_date":2015,"description":"This system, adapted from the Board of Geographic Names (BGN) Romanization system for Russian\n(1947), is the Intelligence Community (IC) standard for the transliteration of Russian names that will be\napplied to all final written reports and products for IC consumers. It is not intended to eliminate variations\nof a name that can contribute forensic information. Rather, it is to provide an IC standard Romanized\n(English) transliteration from Russian that can then be linked to forensic information in ways that will\nhelp identify the referent of the name.\n\nIn cases where an individual’s name has already been transliterated in a variant spelling, the IC Standard\nspelling should appear first, followed by the variant spelling(s) in parentheses at the first usage. E.g.,\nSergey Nikolayevich Tyurin (Serguei Nicolaivitch Tiourine). In addition, if the original Cyrillic spelling\nis known, that spelling should also appear in parentheses following the name, if possible, following best\npractices of the issuing organization and taking into consideration information system capabilities. This\nconvention is designed to ensure that vital forensic information is not lost.\n\nFor non-Russian names, use the relevant IC transliteration standard for names from that language. A\ntranslator’s note may be used to clarify the known origin of the person. Spell names of individuals from\nlanguages that are written in Roman letters as they are spelled in those languages (e.g., George Clooney,\nJorge Garcia, Georges Pompidou).\n\nIn the case of active senior government officials in the on-line CIA World Factbook and the on-line\ndirectory of Chiefs of State and Cabinet Members of Foreign Governments, the spellings given in these\non-line reference works should be used in place of the IC Standard. For any individual who has at one\ntime been listed in the Factbook or Chiefs of State directory but who no longer appears in those resources\n(i.e. is no longer a government official), the IC Standard spelling should appear first, with the spelling, if\nknown, as it previously appeared in those resources listed within parentheses at the first usage.\n\nThe primary goal is to produce a consistent Romanized transcription of names that is specifically readable\nto the English-speaking non-specialist. The system uses the 26 letters of the standard (English) Roman\nalphabet. Some ambiguities in the Romanized form will occur without the use of diacritics. However,\nwithin the context of a report, where additional information about the individual is provided, the referent\nwill be clearly identified. This system will be used in conjunction with on-line tools, name dictionaries,\nand lists containing conventional spellings of names of well-known individuals.\n","notes":null,"tests":[{"source":"Ирина Ивановна Никитина","expected":"Irina Ivanovna Nikitina"},{"source":"Николай Римский-Корсаков","expected":"Nikolay Rimskiy-Korsakov"},{"source":"Михаил Тимофеевич Калашников","expected":"Mikhail Timofeyevich Kalashnikov"},{"source":"Корж Василий Захарович","expected":"Korzh Vasiliy Zakharovich"},{"source":"Циолковский Константин Эдуардович","expected":"Tsiolkovskiy Konstantin Eduardovich"},{"source":"Лобачевский Николай Иванович","expected":"Lobachevskiy Nikolay Ivanovich"},{"source":"Пушкин Александр Сергеевич","expected":"Pushkin Aleksandr Sergeyevich"},{"source":"Гоголь Николай Васильевич","expected":"Gogol Nikolay Vasilyevich"},{"source":"Ломоносов Михаил Васильевич","expected":"Lomonosov Mikhail Vasilyevich"}],"map":{"inherit":"bgnpcgn-rus-Cyrl-Latn-1947","characters":{"\\u042a":"","\\u042c":"","\\u044a":"","\\u044c":""}}},"bgnpcgn-rus-Cyrl-Latn-1947":{"authority_id":"bgnpcgn","id":1947,"language":"iso-639-2:rus","source_script":"Cyrl","destination_script":"Latn","name":"ROMANIZATION OF RUSSIAN, BGN/PCGN 1947 System","alias":{"ogc11122":{"code":"rus_Cyrl2Latn_BGN_1947","description":"Russian US Board on Geographic Names(BGN)/Permanent Committee on Geographical Names for British Official Use(PCGN) 1947 System"}},"url":"https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/807920/ROMANIZATION_OF_RUSSIAN.pdf","creation_date":1947,"confirmation_date":"2019-06","description":"The BGN/PCGN system for Russian was adopted by the BGN in 1944 and by the\nPCGN in 1947 for use in romanizing names written in the Russian Cyrillic\nalphabet.\n","notes":["The character e should be romanized ye initially, after the vowel characters a, e, ё, и, о, у, ы, э, ю, and я, and after й, ъ, and ь. In all other instances, it should be romanized e.","The character ё is not considered a separate character of the Russian alphabet and the dieresis is generally not shown. When the dieresis is shown, the character should be romanized yë initially, after the vowel characters a, e, ё, и, о, у, ы, э, ю, and я, and after й, ъ, and ь. In all other instances, it should be romanized ё. When the dieresis is not shown, the character may still be romanized in the preceding manner or, alternatively, in accordance with note 1.","Unusual Russian character sequences occurring primarily in\nnon-Russian-language names may be romanized as shown below in order to\nprovide differentiation from regularly- occurring digraphs and\ncharacter sequences.\n  й before а, у, ы, or э у·\n  ы before а, у, ы, or э у·\n  ы after any vowel character ·у\n  э after any consonant character except й ·е\n  TC t·s шч sh·ch\n","Unicode values are shown with the uppercase Cyrillic character first, followed by the lowercase character.","An inventory of letter-diacritic combinations, with their Unicode\nencoding, in addition to the unmodified letters of the basic Roman\nscript is:\n  All apostrophes appearing in romanization are U+2019 Ë (U+00CB)\n  ë (U+00EB)\n","The Romanization column shows only lowercase forms but, when romanizing, uppercase and lowercase Roman letters as appropriate should be used."],"tests":[{"source":"Выборы депутатов Государственной Думы Федерального Собрания Российской Федерации седьмого созыва\nДата голосования: 18.09.2016\n\nНаименование Избирательной комиссии:    ЦИК России\n\nСводная таблица результатов выборов по федеральному избирательному округу\n\n\nЧисло избирателей, внесенных в список избирателей на момент окончания голосования\nЧисло избирательных бюллетеней, полученных участковой избирательной комиссией\nЧисло избирательных бюллетеней, выданных избирателям, проголосовавшим досрочно\nЧисло избирательных бюллетеней, выданных в помещении для голосования в день голосования\nЧисло избирательных бюллетеней, выданных вне помещения для голосования в день голосования\nЧисло погашенных избирательных бюллетеней\nЧисло избирательных бюллетеней, содержащихся в переносных ящиках для голосования\nЧисло избирательных бюллетеней, содержащихся в стационарных ящиках для голосования\nЧисло недействительных избирательных бюллетеней\nЧисло действительных избирательных бюллетеней\nЧисло открепительных удостоверений, полученных участковой избирательной комиссией\nЧисло открепительных удостоверений, выданных на избирательном участке до дня голосования\nЧисло избирателей, проголосовавших по открепительным удостоверениям на избирательном участке\nЧисло погашенных неиспользованных открепительных удостоверений\nЧисло открепительных удостоверений, выданных избирателям территориальной избирательной комиссией\nЧисло утраченных открепительных удостоверений\nЧисло утраченных избирательных бюллетеней\nЧисло избирательных бюллетеней, не учтенных при получении\n1. ВСЕРОССИЙСКАЯ ПОЛИТИЧЕСКАЯ ПАРТИЯ \"РОДИНА\"\n2. Политическая партия КОММУНИСТИЧЕСКАЯ ПАРТИЯ КОММУНИСТЫ РОССИИ\n3. Политическая партия \"Российская партия пенсионеров за справедливость\"\n4. Всероссийская политическая партия \"ЕДИНАЯ РОССИЯ\"\n5. Политическая партия \"Российская экологическая партия \"Зеленые\"\n6. Политическая партия \"Гражданская Платформа\"\n7. Политическая партия ЛДПР - Либерально-демократическая партия России\n8. Политическая партия \"Партия народной свободы\" (ПАРНАС)\n9. Всероссийская политическая партия \"ПАРТИЯ РОСТА\"\n10. Общественная организация Всероссийская политическая партия \"Гражданская Сила\"\n11. Политическая партия \"Российская объединенная демократическая партия \"ЯБЛОКО\"\n12. Политическая партия \"КОММУНИСТИЧЕСКАЯ ПАРТИЯ РОССИЙСКОЙ ФЕДЕРАЦИИ\"\n13. Политическая партия \"ПАТРИОТЫ РОССИИ\"\n14. Политическая партия СПРАВЕДЛИВАЯ РОССИЯ\n\nДанные окружных избирательных комиссий о числе открепительных удостоверений\n\n\nЧисло открепительных удостоверений, полученных окружной избирательной комиссией\nЧисло открепительных удостоверений, выданных территориальным избирательным комиссиям\nЧисло неиспользованных открепительных удостоверений, погашенных окружной избирательной комиссией\nЧисло открепительных удостоверений, утраченных в окружной избирательной комиссии\n","expected":"Vybory deputatov Gosudarstvennoy Dumy Federal’nogo Sobraniya Rossiyskoy Federatsii sed’mogo sozyva\nData golosovaniya: 18.09.2016\n\nNaimenovaniye Izbiratel’noy komissii:    TSIK Rossii\n\nSvodnaya tablitsa rezul’tatov vyborov po federal’nomu izbiratel’nomu okrugu\n\n\nChislo izbirateley, vnesennykh v spisok izbirateley na moment okonchaniya golosovaniya\nChislo izbiratel’nykh byulleteney, poluchennykh uchastkovoy izbiratel’noy komissiyey\nChislo izbiratel’nykh byulleteney, vydannykh izbiratelyam, progolosovavshim dosrochno\nChislo izbiratel’nykh byulleteney, vydannykh v pomeshchenii dlya golosovaniya v den’ golosovaniya\nChislo izbiratel’nykh byulleteney, vydannykh vne pomeshcheniya dlya golosovaniya v den’ golosovaniya\nChislo pogashennykh izbiratel’nykh byulleteney\nChislo izbiratel’nykh byulleteney, soderzhashchikhsya v perenosnykh yashchikakh dlya golosovaniya\nChislo izbiratel’nykh byulleteney, soderzhashchikhsya v statsionarnykh yashchikakh dlya golosovaniya\nChislo nedeystvitel’nykh izbiratel’nykh byulleteney\nChislo deystvitel’nykh izbiratel’nykh byulleteney\nChislo otkrepitel’nykh udostovereniy, poluchennykh uchastkovoy izbiratel’noy komissiyey\nChislo otkrepitel’nykh udostovereniy, vydannykh na izbiratel’nom uchastke do dnya golosovaniya\nChislo izbirateley, progolosovavshikh po otkrepitel’nym udostovereniyam na izbiratel’nom uchastke\nChislo pogashennykh neispol’zovannykh otkrepitel’nykh udostovereniy\nChislo otkrepitel’nykh udostovereniy, vydannykh izbiratelyam territorial’noy izbiratel’noy komissiyey\nChislo utrachennykh otkrepitel’nykh udostovereniy\nChislo utrachennykh izbiratel’nykh byulleteney\nChislo izbiratel’nykh byulleteney, ne uchtennykh pri poluchenii\n1. VSEROSSIYSKAYA POLITICHESKAYA PARTIYA \"RODINA\"\n2. Politicheskaya partiya KOMMUNISTICHESKAYA PARTIYA KOMMUNISTY ROSSII\n3. Politicheskaya partiya \"Rossiyskaya partiya pensionerov za spravedlivost’\"\n4. Vserossiyskaya politicheskaya partiya \"YEDINAYA ROSSIYA\"\n5. Politicheskaya partiya \"Rossiyskaya ekologicheskaya partiya \"Zelenyye\"\n6. Politicheskaya partiya \"Grazhdanskaya Platforma\"\n7. Politicheskaya partiya LDPR - Liberal’no-demokraticheskaya partiya Rossii\n8. Politicheskaya partiya \"Partiya narodnoy svobody\" (PARNAS)\n9. Vserossiyskaya politicheskaya partiya \"PARTIYA ROSTA\"\n10. Obshchestvennaya organizatsiya Vserossiyskaya politicheskaya partiya \"Grazhdanskaya Sila\"\n11. Politicheskaya partiya \"Rossiyskaya ob\"yedinennaya demokraticheskaya partiya \"YABLOKO\"\n12. Politicheskaya partiya \"KOMMUNISTICHESKAYA PARTIYA ROSSIYSKOY FEDERATSII\"\n13. Politicheskaya partiya \"PATRIOTY ROSSII\"\n14. Politicheskaya partiya SPRAVEDLIVAYA ROSSIYA\n\nDannyye okruzhnykh izbiratel’nykh komissiy o chisle otkrepitel’nykh udostovereniy\n\n\nChislo otkrepitel’nykh udostovereniy, poluchennykh okruzhnoy izbiratel’noy komissiyey\nChislo otkrepitel’nykh udostovereniy, vydannykh territorial’nym izbiratel’nym komissiyam\nChislo neispol’zovannykh otkrepitel’nykh udostovereniy, pogashennykh okruzhnoy izbiratel’noy komissiyey\nChislo otkrepitel’nykh udostovereniy, utrachennykh v okruzhnoy izbiratel’noy komissii\n"},{"source":"ДЛИННОЕ ПОКРЫВАЛО","expected":"DLINNOYE POKRYVALO"},{"source":"Еловая шишка","expected":"Yelovaya shishka"},{"source":"ЕЛОВАЯ ШИШКА","expected":"YELOVAYA SHISHKA"},{"source":"Длинное покрывало","expected":"Dlinnoye pokryvalo"},{"source":"В лесу еловые шишки","expected":"V lesu yelovyye shishki"},{"source":"OН ВИДЕЛ ЕЁ В ПЕРВЫЙ РАЗ","expected":"ON VIDEL YEYË V PERVYY RAZ"},{"source":"Ёж колючий","expected":"Yëzh kolyuchiy"},{"source":"ЁЖ КОЛЮЧИЙ","expected":"YËZH KOLYUCHIY"},{"source":"Он видел её в первый раз","expected":"On videl yeyë v pervyy raz"},{"source":"У ёжа колючки","expected":"U yëzha kolyuchki"},{"source":"ЙА Йа йа","expected":"Y·A Y·a y·a"},{"source":"ЫУ Ыу ыу","expected":"Y·U Y·u y·u"},{"source":"ОЫ Оы оы","expected":"O·Y O·y o·y"},{"source":"ОЫУ Оыу оыу","expected":"O·Y·U O·y·u o·y·u"},{"source":"СЭ Сэ сэ","expected":"S·E S·e s·e"},{"source":"ТС тс Тс тС","expected":"T·S t·s T·s t·S"},{"source":"ШЧ шч Шч шЧ","expected":"SH·CH sh·ch Sh·ch sh·Ch"}],"map":{"rules":[{"pattern":"(?<=[АаЕеЁёИиОоУуЫыЭэЮюЯяЙйЪъЬь])\\u0401","result":"Yë"},{"pattern":"(?<=[АаЕеЁёИиОоУуЫыЭэЮюЯяЙйЪъЬь])\\u0451","result":"yë"},{"pattern":"(?<=[АаЕеЁёИиОоУуЫыЭэЮюЯяЙйЪъЬь])\\u0415","result":"YЕ"},{"pattern":"\\b\\u0415","result":"Yе"},{"pattern":"(?<=[АаЕеЁёИиОоУуЫыЭэЮюЯяЙйЪъЬь])\\u0435","result":"yе"},{"pattern":"\\b\\u0435","result":"yе"},{"pattern":"(?<=[АаЕеЁёИиОоУуЫыЭэЮюЯяЙйЪъЬь])\\u0401","result":"Yë"},{"pattern":"\\b\\u0401","result":"Yë"},{"pattern":"(?<=[АаЕеЁёИиОоУуЫыЭэЮюЯяЙйЪъЬь])\\u0451","result":"yë"},{"pattern":"\\b\\u0451","result":"yë"},{"pattern":"\\u0419(?=[АаУуЫыЭэ])","result":"Y·"},{"pattern":"\\u0439(?=[АаУуЫыЭэ])","result":"y·"},{"pattern":"(?<=[АаЕеЁёИиОоУуЫыЭэЮюЯя])\\u042b(?=[АаУуЫыЭэ])","result":"·Y·"},{"pattern":"(?<=[АаЕеЁёИиОоУуЫыЭэЮюЯя])\\u044b(?=[АаУуЫыЭэ])","result":"·y·"},{"pattern":"\\u042b(?=[АаУуЫыЭэ])","result":"Ы·"},{"pattern":"\\u044b(?=[АаУуЫыЭэ])","result":"ы·"},{"pattern":"(?<=[Оо])\\u042b","result":"·Y"},{"pattern":"(?<=[Оо])\\u044b","result":"·y"},{"pattern":"\\b\\u0401","result":"Yë"},{"pattern":"\\b\\u0451","result":"yë"},{"pattern":"(?<=[БбВвГгДдЖжЗзКкЛлМмНнПпРрСсТтФфХхЦцЧчШшЩщ])\\u042d","result":"·E"},{"pattern":"(?<=[БбВвГгДдЖжЗзКкЛлМмНнПпРрСсТтФфХхЦцЧчШшЩщ])\\u044d","result":"·e"},{"pattern":"(Т|т)(С|с)","result":"\\1·\\2"},{"pattern":"(Ш|ш)(Ч|ч)","result":"\\1·\\2"}],"postrules":[{"pattern":"((?<=[[:upper:]])Ye(?=[[:upper:]])?|(?<=[[:upper:]])?Ye(?=[[:upper:]]))","result":"YE"},{"pattern":"((?<=[[:upper:]])Yë(?=[[:upper:]])?|(?<=[[:upper:]])?Yë(?=[[:upper:]]))","result":"YË"}],"characters":{"А":"A","Б":"B","В":"V","Г":"G","Д":"D","Е":"E","Ё":"Ë","Ж":"Zh","З":"Z","И":"I","Й":"Y","К":"K","Л":"L","М":"M","Н":"N","О":"O","П":"P","Р":"R","С":"S","Т":"T","У":"U","Ф":"F","Х":"Kh","Ц":"Ts","Ч":"Ch","Ш":"Sh","Щ":"Shch","Ъ":"\"","Ы":"Y","Ь":"’","Э":"E","Ю":"Yu","Я":"Ya","а":"a","б":"b","в":"v","г":"g","д":"d","е":"e","ё":"ë","ж":"zh","з":"z","и":"i","й":"y","к":"k","л":"l","м":"m","н":"n","о":"o","п":"p","р":"r","с":"s","т":"t","у":"u","ф":"f","х":"kh","ц":"ts","ч":"ch","ш":"sh","щ":"shch","ъ":"\"","ы":"y","ь":"’","э":"e","ю":"yu","я":"ya"}}}}