{"odni-uzb-Cyrl-Latn-2015":{"authority_id":"odni","id":2015,"language":"iso-639-2:uzb","source_script":"Cyrl","destination_script":"Latn","name":"Office of the Director Of National Intelligence Uzbek Personal Names 2015, ICS-630-01 Annex V","source":"ICS-630-01 Annex V","creation_date":2015,"confirmation_date":2015,"description":"This system is the Intelligence Community standard for the transliteration of Uzbek person names\nthat will be applied to all final written reports and products for IC consumers. It is not intended to\neliminate variations of a name that can contribute forensic information. Rather, it is to provide an\nIC standard Romanized (English) transliteration from Uzbek that can then be linked to forensic\ninformation in ways that will help identify the referent of the name.\n\nIn cases where an individual’s name has already been transliterated in a variant spelling, the IC\nStandard spelling should appear first, followed by the variant spelling(s) in parentheses at the first\nusage. In addition, if the original Cyrillic-script spelling is known, that spelling should also\nappear in parentheses following the name, if possible, following best practices of the issuing\norganization and taking into consideration information system capabilities. For example:\nFarkhod Tojiev (also seen as Farhod Tadjiyev, Фарход Тожиев). This convention is designed to\nensure that vital forensic information is not lost.\n\nFor names of persons who are known to not be part of the Uzbek-speaking community, use the\nrelevant IC transliteration standard for names from that language (e.g., Yitzhak). A translator’s\nnote may be used to clarify the known origin of the person. Spell names of individuals from\nlanguages that are written in Roman letters as they are spelled in those languages (e.g., George\nClooney, Jorge Garcia, Georges Pompidou).\n\nIn the case of active senior government officials in the on-line CIA World Factbook and the online directory of Chiefs of State and Cabinet Members of Foreign Governments, the spellings\ngiven in these on-line reference works should be used in place of the IC Standard. For any\nindividual who has at one time been listed in the Factbook or Chiefs of State directory but who no\nlonger appears in those resources (i.e. is no longer a government official), the IC Standard\nspelling should appear first, with the spelling, if known, as it previously appeared in those\nresources listed within parentheses at the first usage.\n\nThe primary goal is to produce a consistent Romanized transcription of names that is specifically\nreadable to the English-speaking non-specialist. The system uses the 26 letters of the standard\n(English) Roman alphabet. Some ambiguities in the Romanized form will occur without the use\nof diacritics. However, within the context of a report, where additional information about the\nindividual is provided, the referent will be clearly identified. This system will be used in\nconjunction with on-line tools, name dictionaries, and lists containing conventional spellings of\nnames of well-known individuals.\n","notes":["Transliterate double digraphs as a single digraph, i.e. шш -> sh, not shsh","In the Roman, no distinction is made between digraphs such as 'sh' and single contiguous letters, (e.g. 's' followed by 'h').","The Cyrillic ъ and ь are not transliterated, but instead are left out of the transliteration."],"tests":[{"source":"Фарход Тожиев","expected":"Farkhod Tojiev"},{"source":"Барча одамлар эркин, қадр-қиммат в ҳуқуқлард тенг бўлиб туғиладилар. Улар ақл в виждон соҳибидирлар в бир-бирлари ила биродарларча муомал қилишларь зарур.","expected":"Barcha odamlar erkin, qadr-qimat v huquqlard teng bolib tughiladilar. Ular aql v vijdon sohibidirlar v bir-birlari ila birodarlarcha muomal qilishlar zarur."},{"source":"Тутук белгись","expected":"Tutuk belgis"},{"source":"Янги юл","expected":"Yangi iul"},{"source":"Ўзбек ёзуви","expected":"Ozbek yozuvi"},{"source":"Чиғатай гурунги","expected":"Chighatay gurungi"},{"source":"ъ","expected":""},{"source":"шш","expected":"sh"},{"source":"ччччч","expected":"ch"}],"map":{"rules":[{"pattern":"(.)\\1{1,}","result":"\\1"}],"characters":{"\\u0410":"A","\\u0411":"B","\\u0412":"V","\\u0413":"G","\\u0492":"Gh","\\u0414":"D","\\u0415":"E","\\u0401":"Yo","\\u0416":"J","\\u0417":"Z","\\u0418":"I","\\u0419":"Y","\\u041A":"K","\\u049A":"Q","\\u041B":"L","\\u041C":"M","\\u041D":"N","\\u041E":"O","\\u041F":"P","\\u0420":"R","\\u0421":"S","\\u0422":"T","\\u0423":"U","\\u040E":"O","\\u0424":"F","\\u0425":"Kh","\\u04B2":"H","\\u0426":"Ts","\\u0427":"Ch","\\u0428":"Sh","\\u042D":"E","\\u042E":"Yu","\\u042F":"Ya","\\u0430":"a","\\u0431":"b","\\u0432":"v","\\u0433":"g","\\u0493":"gh","\\u0434":"d","\\u0435":"e","\\u0451":"yo","\\u0436":"j","\\u0437":"z","\\u0438":"i","\\u0439":"y","\\u043A":"k","\\u049B":"q","\\u043B":"l","\\u043C":"m","\\u043D":"n","\\u043E":"o","\\u043F":"p","\\u0440":"r","\\u0441":"s","\\u0442":"t","\\u0443":"u","\\u045E":"o","\\u0444":"f","\\u044B":"y","\\u0447":"ch","\\u044F":"ia","\\u044E":"iu","\\u0445":"kh","\\u04B3":"h","\\u0448":"sh","\\u044D":"e","\\u0449":"shch","\\u0446":"ts","\\u0491":"g","\\u046B":"u","\\u0452":"d","\\u0455":"dz","\\u0458":"j","\\u0459":"lj","\\u045A":"nj","\\u04BB":"c","\\u045F":"dz","\\u0454":"ie","\\u0457":"i","\\u0453":"g","\\u042a":"","\\u042c":"","\\u044a":"","\\u044c":""}}}}