{"odni-fas-Arab-Latn-2015":{"authority_id":"odni","id":2015,"language":"iso-639-2:fas","source_script":"Arab","destination_script":"Latn","name":"ODNI Persian Farsi Dari Personal Names 2015 System, ICS-630-01 Annex J","url":"https://github.com/interscript/ics-630-01/blob/master/reference-docs/ANNEX%20J%20-%20Persian-Farsi_Dari_Personal_Names_FLTS_2018_Revision%20(U).pdf","creation_date":2015,"confirmation_date":"2015-11","description":"This system is the Intelligence Community (IC) standard for\nthe transliteration of Persian (Farsi)\nand Dari names that is applied to all final written reports\nand products for IC consumers. It is not\nintended to eliminate variations of a name that can\ncontribute forensic information. Rather, it is\nto provide an IC standard Romanized (English)\ntransliteration from Persian (Farsi) and Dari that\ncan then be linked to forensic information in ways that\nwill help identify the referent of the\nname.\n\nIn cases where an individual’s name has already been\ntransliterated in a variant spelling, the IC\nStandard spelling should appear first, followed by the\nvariant spelling(s) in parentheses at the\nfirst usage. In addition, if the original Perso-Arabic\nscript spelling is known, that spelling should\nalso appear in parentheses following the name, if possible,\nfollowing best practices of the issuing\norganization and taking into consideration information\nsystem capabilities. This convention is\ndesigned to ensure that vital forensic information is not\nlost while maintaining consistency.\n\nFor names of individuals who are not part of the Persian-(\nFarsi) or Dari-speaking community,\nbut whose names are encountered in Farsi or Dari, use the\nrelevant IC transliteration standard for\nnames from that language (e.g., Mikhail, Yitzhak, Abu-\nMurtada). Spell names of individuals\nfrom languages that are written in Roman letters as they\nare spelled in those languages (e.g.,\nGeorge Clooney, Jorge Garcia, Georges Pompidou).\nIn the case of active senior government officials in the\nonline CIA World Factbook and the\nonline directory of Chiefs of State and Cabinet Members of\nForeign Governments, the spellings\ngiven in these online reference works should be used in\nplace of the IC Standard, with the IC\nStandard included as a variant in parentheses at the first\nusage. For any individual who has at one\ntime been listed in the Factbook or Chiefs of State\ndirectory but who no longer appears in those\nresources (i.e., is no longer a government official), the\nIC Standard spelling should appear first,\nwith the spelling, if known, as it previously appeared in\nthose resources listed within parentheses\nat the first usage (e.g., former president Mahmud\nAhmadinezhad (Ahmadi-Nejad).\n\nThe primary goal is to produce a consistent Romanized\ntranscription of names that is specifically\nreadable to the English-speaking non-specialist. The system\nuses the 26 letters of the standard\n(English) Roman alphabet plus the apostrophe and hyphen.\nSome ambiguities in the Romanized\nform will occur without the use of diacritics. However,\nwithin the context of a report, where\nadditional information about the individual is provided,\nthe referent will be clearly identified.\nThis system will be used in conjunction with online tools,\nname dictionaries, and lists containing\nconventional spellings of names of well-known individuals.\n","notes":["Alef maqsura (final yeh pronounced as a long “a”) should\nbe written “a” as in “Musa.”\n","Digraphs: No distinction is drawn between digraphs such\nas sh and single contiguous letters\n(e.g., s followed by h).\n","Long/short vowels: There is no distinction made between\nlong and short a. E.g., Farzad (the\nfirst a is short, the second long).\n","Diphthongs: The diphthong such as in the name Hosein is\nwritten ei. Following the\npredominant lack of pronunciation of the ow diphthong in\nFarsi, this diphthong will not be\nrepresented (Khosro, not Khosrow).\n","Apostrophe: The apostrophe is used in three cases: 1) to\nrepresent a name-internal or terminal\nhamzeh or ein (Mo’men, Ghane’), 2) to represent the first\nyeh (ی (in a double yeh (یی (\nconstruction (since رضایی is simply an orthographic variant\nof رضائی – both are rendered\nReza’i), and 3) to represent the alef (ا (in the special\ncase of a name ending in ای ه) e.g.,\nBadreh’i, Ganjeh’i). Name-initially, however, neither\nhamzeh nor ein are indicated in\ntransliteration (Abdorrahman, not 'Abdorrahman).\n","Double consonants: Double consonants represented by the\ntashdid are shown by doubling the\nRoman letter: Mo'azzami, Tavakkoli, Sajjad. Exceptions: Ein\nand consonants represented by\nRoman digraphs (e.g., sh, ch) are not doubled (Mobasher,\nnot Mobashsher). Double letters\nare only used for tashdid (Hosein, not Hossein) or to\nreflect “sun-letter” assimilation (see\nbelow). Special care should be taken when possible to\ndiscriminate between doubled and\nnon-doubled letters in names that are otherwise\nindistinguishable in their transliterated forms:\nHasan (حسن (vs. Hassan (حسان(\n","Hyphens: A hyphen will be used for compound\nlast names to connect major name elements (e.g., Raja’i-\nKhorasani, Tabataba’i-Shirazi, Soleimani-Meimandi). No\nspaces are to be used for last names to reduce ambiguity (\nwith the exception of certain Arabic-origin constructions\nas specified below). Hyphens are not used to attach minor\nelements and suffixes/prefixes, or to show ezafeh\nconstructions in or between names (Shahrbabak, not Shahr-e\nBabak). It should be understood that when a full compound\nlast name is available, the second major element is\ntypically omitted for normal use, while the first major\nelement of the last name is preferred. It is thus\nrecommended as a best practice for reporting that both of\nthese names, if known, be included at the first instance,\nand only the family name be used thereafter in the report (\nunless it is known that a specific individual is commonly\nknown otherwise). E.g., “Mohammad Mahmudi-Tehrani (\nhereafter Mahmudi).”\n","Compound first names will be written as distinct words:\nAli Reza (not Alireza or Ali-Reza);\nMohammad Hosein (not Mohammadhosein or Mohammad-Hosein),\nwith the exception of cases identified below.\n","Arabic-origin names that incorporate the word “Allah” are\ntransliterated as one word, with the letter ‘o’ replacing the\nalef in Allah (Azizollah, Rahimollah).\n","Name-internal Arabic definite article \"al\" (‫)ال‬: Common\nin many names borrowed\nfrom Arabic, the transliteration should follow the Arabic\nrules for “sun letter” assimilation in spoken form and\nreflect the nominative case. That is: Abdorrahman, not Abd-\nal-Rahman. (The Arabic sun letters are: ‫ت‬،‫ث‬،‫د‬،‫ذ‬،\n‫ر‬، ‫ز‬،‫س‬،‫ش‬،‫ص‬،‫ض‬،‫ط‬،‫ظ‬،‫ل‬،‫ن‬ . These correspond with\nd, l, n, r, s, sh, t, and z.) Note that the moon letters (\ni.e., all other Arabic letters) are not assimilated (e.g.,\nAbdolhasan, Abolfazl). Note also that the “Abdollah” and\n“Abdol + attribute of Allah” names are written as a single\nword, as are other names that contain the definite article:\nShamsoddin (not Shams-al-Din), Nezamoddin, etc.\n","Name-initial Arabic definite article \"al\" (‫)ال‬: For\nArabic-origin names starting with the definite article “al” (‫)\nال‬, follow the Arabic standard of al-Sisi (‫)الصیصی‬ (not\nAlsisi or Assisi) and forego sun-letter assimilation.\n","Arabic \"family marker\" of Al (‫)آل‬: For Arabic-origin\nnames starting with the \"family marker\" of Al (‫)آل‬,\nfollow the Arabic standard of Al Davud (‫داود‬ ‫)آل‬ (not\nAldavud or Aledavud).\n","Kunyas: In the rather rare case where\na Persian uses a kunya (a name for an adult normally\nderived from his or her eldest child, and sometimes\nemployed as a nom de guerre), this name will be rendered\nwith a space separating the two elements (Abu Hosein, Abu\nGhasem). Note that this does not apply when the person's\ngiven or family name was derived from a predecessor's\nkunya. In these cases, the leading element should be\ntreated as a prefix as indicated below (Abuhosein[i],\nAbughasem[i]).\n","Persian names of non-Persian origin that are\nno longer considered foreign by Farsi speakers (commonly of\nArabic or Hebrew origin) follow this IC transliteration\nstandard for Persian. E.g., Yusef (not Joseph), Davud (not\nDavid), Reza (not Rida), Abutorab (not Abu-Turab),\nAbolfazl (not Abu-al-Fadl). However, in the uncommon event\nthe name of an Iranian with a non-Persian name appears in\nFarsi (possibly as a result of mixed parentage), it is\nspelled according to the standard Western tradition or the\nappropriate IC standard: James, Georges, Pedro, Jiang.\n"],"tests":[{"source":"مُوسَى","expected":"musa"},{"source":"مُؤمِن","expected":"mo’men"},{"source":"رِضايي","expected":"reza’i"},{"source":"مُبَشِّر","expected":"mobasher"},{"source":"حَسَّان","expected":"hassan"},{"source":"حَسَن","expected":"hasan"},{"source":"صَفَّار","expected":"saffar"},{"source":"صَفَر","expected":"safar"}],"map":{"characters":{"\\s(?=\\u0622\\u0628\\u064E\\u0627\\u062F)":"","\\ufdf2":"Allah","\\s\\u0627\\u0644\\u0644\\u0651\\u064e\\u0647":"ollah","\\u0652":"","\\u0659":"ê","\\u064e\\u064a\\u0652":"ay","\\u0649\\u0670":"á","\\u0674":"-e","\\u0654":"-e","\\u0629":"eh","\\u0626":"’","\\u0624":"’","\\u0623":"","\\u0625":"","\\b\\u0627\\u0644":"al ","\\b\\u0622\\\\u0644":"Al ","\\b\\u0627\\u0644\\u062a":"at t","\\b\\u0627\\u0644\\u062b":"as s","\\b\\u0627\\u0644\\u062f":"ad d","\\b\\u0627\\u0644\\u0630":"az z","\\b\\u0627\\u0644\\u0631":"ar r","\\b\\u0627\\u0644\\u0632":"az z","\\b\\u0627\\u0644\\u0633":"as s","\\b\\u0627\\u0644\\u0634":"ash sh","\\b\\u0627\\u0644\\u0635":"as s","\\b\\u0627\\u0644\\u0636":"az z","\\b\\u0627\\u0644\\u0637":"at t","\\b\\u0627\\u0644\\u0638":"az z","\\b\\u0627\\u0644\\u0644":"al l","\\b\\u0627\\u0644\\u0646":"an n","\\u0622":"a","\\u064e":"a","(?<=\\u064e)\\u0627":"","(?<!\\b)\\u0627":"a","\\b\\u0627\\u064e":"a","\\b\\u0627\\u064f":"o","\\b\\u0627\\u0650":"e","\\u064f":"o","\\u064f\\u0648":"u","\\u0650":"e","\\u0650\\u064a":"i","\\u0650\\u06cc":"i","\\u0650\\u064a\\u0651\\u064e":"iy","\\u0650\\u06cc\\u0651\\u064e":"iy","\\u0650\\u064a(?=\\u064e|u064f)":"iy","\\u0628\\u0651":"bb","\\u062a\\u0651":"tt","\\u062b\\u0651":"ss","\\u062c\\u0651":"jj","\\u062d\\u0651":"hh","\\u062e\\u0651":"kh","\\u062f\\u0651":"dd","\\u0630\\u0651":"zz","\\u0631\\u0651":"rr","\\u0632\\u0651":"zz","\\u0633\\u0651":"ss","\\u0634\\u0651":"sh","\\u0635\\u0651":"ss","\\u0636\\u0651":"zz","\\u0637\\u0651":"tt","\\u0638\\u0651":"zz","\\u063a\\u0651":"gh","\\u0641\\u0651":"ff","\\u0642\\u0651":"gh","\\u0643\\u0651":"kk","\\u0644\\u0651":"ll","\\u0645\\u0651":"mm","\\u0646\\u0651":"nn","\\u0647\\u0651":"hh","\\u0648\\u0651":"vv","\\u064a\\u0651":"yy","(?<=\\b)\\u0621":"","\\u0621":"’","\\u064e\\u0649":"a","\\u0649":"y","\\u064a\\u064a":"’i","\\u06cc\\u06cc":"’i","\\u0627\\u064a\\b":"’i","\\u0627\\u06cc\\b":"’i","\\u0628":"b","\\u067E":"p","\\u062a":"t","\\u062B":"s","\\u062c":"j","\\u0686":"ch","\\u062d":"h","\\u062e":"kh","\\u062f":"d","\\u0630":"z","\\u0631":"r","\\u0632":"z","\\u0698":"zh","\\u0633":"s","\\u0634":"sh","\\u0635":"s","\\u0636":"z","\\u0637":"t","\\u0638":"z","\\u0639":"‘","(?<=\\b)\\u0639":"","\\u063a":"gh","\\u0641":"f","\\u0642":"gh","\\u0643":"k","\\u06AF":"g","\\u0644":"l","\\u0645":"m","\\u0646":"n","\\u0647":"h","\\u0648":"v","\\u064a":"y","\\u06D0":"ē","\\u06CD":"êy"}}}}