{"un-ara-Arab-Latn-1971":{"authority_id":"ungegn","id":1971,"language":"iso-639-2:ara","source_script":"Arab","destination_script":"Latn","name":"1971 \"Beirut system\"","url":"https://unstats.un.org/unsd/geoinfo/UNGEGN/docs/2nd-uncsgn-docs/E_Conf61_4_Add1_e.pdf","creation_date":1971,"confirmation date":"2018-06","description":"The current United Nations recommended romanization\nsystem was approved in 2017 (resolution XI/3), based on\nthe system adopted by Arabic experts at the conference\nheld in Beirut in 2007, the Unified Arabic\nTransliteration System, taking into account the\npractical amendments and corrections carried out and\nagreed upon by the representatives of the Arabic-\nspeaking countries at the Fourth Arab Conference on\nGeographical Names, held in Beirut in 2008, and some\nclarifications and amendments agreed in Riyadh in 20171.\nPreviously, the United Nations had approved a\nromanization system in 1972 (resolution II/8), based on the\nsystem adopted by Arabic experts at the conference\nheld at Beirut in 1971 with the practical amendments carried out\nand agreed upon by the representatives of the Arabic-speaking\ncountries at their conference. The table was published in volume\nII of the conference report.\nIn UN resolution XI/3 it is specifically stated that the\nsystem was recommended for the “romanization of the\ngeographical names within those Arabic-speaking countries\nwhere this system is officially adopted”. There is\nevidence of its partial implementation in Jordan, Oman and\nSaudi Arabia. The UNGEGN Working Group on Romanization\nSystems intends to continue monitoring the UN system’s\nimplementation across Arabic-speaking countries.\nIn some countries there exist local romanization schemes\nor practices. The geographical names of Algeria, Djibouti,\nMauritania, Morocco and Tunisia are generally rendered in\nthe traditional manner which conforms to the principles of\nthe French orthography.\nThe previous UN-approved system is still found in\nconsiderable international usage.\nArabic is written from right to left. The Arabic script\nusually omits vowel points and diacritical marks from\nwriting which makes it difficult to obtain uniform results\nin the romanization of Arabic. It is essential to identify\ncorrectly the words which appear in any particular name\nand to know the standard Arabic-script spelling including\nthe relevant vowels. One must also take into account\ndialectal and idiosyncratic deviations. The romanization\nis generally reversible though there may be some ambiguous\nletter sequences (dh, kh, sh, th) which may also point to\ncombinations of Arabic characters in addition to the\nrespective single characters.\n","notes":["ث is t͟h (th with sub marcon)\nخ is k͟h (kh with sub marcon)\nذ is d͟h (dh with sub marcon)\nش is s͟h (sh with sub marcon)\nظ is z͟h (zh with sub marcon)\nغ is g͟h (gh witg sub marcon)\nThe previous UN 1972 System had the following differences:\nthe character (ظ) was romanized as z̧ instead of d͟h;\nthe cedilla (¸) was used instead of sub-macron (_) in all characters with sub-macrons.  - |\n"],"tests":[{"source":"خَيبَر","expected":"K͟haybar"},{"source":"ظَهران","expected":"Z͟hahrān"},{"source":"القُدس","expected":"Al Quds"},{"source":"شَرم الشَيْخ","expected":"S͟harm as͟h S͟hayk͟h"}],"map":{"inherit":"un-ara-Arab-Latn-2017","map":null,"postrules":[{"pattern":" At͟h T͟h","result":" at͟h T͟h"},{"pattern":" Ad͟h D͟h","result":" ad͟h D͟h"},{"pattern":" As͟h S͟h","result":" as͟h S͟h"},{"pattern":" Az͟h Z͟h","result":" az͟h Z͟h"}],"characters":{"\\b\\u0627\\u0644\\u062b":"at͟h t͟h","\\b\\u0627\\u0644\\u0630":"ad͟h d͟h","\\b\\u0627\\u0644\\u0634":"as͟h s͟h","\\b\\u0627\\u0644\\u0638":"az͟h z͟h","\\u062e\\u0651":"k͟hk͟h","\\u0630\\u0651":"d͟hd͟h","\\u0634\\u0651":"s͟h","\\u0638\\u0651":"z͟hz͟h","\\u063a\\u0651":"g͟hg͟h","\\u062b":"t͟h","\\ufe9b":"t͟h","\\ufe9c":"t͟h","\\ufe9a":"t͟h","\\u062e":"k͟h","\\ufea7":"k͟h","\\ufea8":"k͟h","\\ufea6":"k͟h","\\u063a":"g͟h","\\ufecf":"g͟h","\\ufed0":"g͟h","\\ufece":"g͟h","\\u0630":"d͟h","\\ufeac":"d͟h","\\u0634":"s͟h","\\ufeb7":"s͟h","\\ufeb8":"s͟h","\\ufeb6":"s͟h","\\u0638":"z͟h","\\ufec7":"z͟h","\\ufec8":"z͟h","\\ufec6":"z͟h"}}}}