{"var-mon-Mong-Latn-1930":{"authority_id":"var","id":1930,"language":"iso-639-2:mon","source_script":"Mong","destination_script":"Latn","name":"Mongolian Latin alphabet","url":"https://en.m.wikipedia.org/wiki/Mongolian_Latin_alphabet","creation_date":null,"description":"Latin alphabet was using \"y\" as feminine \"u\", with additional\nfeminine \"o\" (\"ө\") and with additional consonants \"ç\" for \"ch\", \"ş\"\nfor \"sh\" and \"ƶ\" for \"j\", it successfully served in printing books\nand newspapers. A few of the letters (f, k, p, v) were rarely used,\nbeing found only in borrowings, while q, w and x were excluded\naltogether. Since k transcribed [h] in loans, it is unclear how loans\nin [kʰ] were written. \"j\" is used for vowel combinations of the [ja]\ntype. Letter \"c\" is used for the sound [ts] and \"k\" is used for the \nound [h]. The first version was inspired by the Yanalif script used\nfor the Soviet Union's Turkic languages.\n\nThe orthography of the Mongolian Latin is based on the orthography of\nthe Classical Mongolian script. It preserves short final vowels. It\ndoes not drop unstressed vowels in the closing syllables when the word\nis conjugated. The suffixes and inflections without long or i-coupled\nvowels are made open syllables ending with a vowel, which is harmonized\nwith the stressed vowel. The rule for the vowel harmony for unstressed\nvowels is similar to that of the Mongolian Cyrillic. It does not use\nconsonant combinations to denote new consonant sounds. For both of the\nversion, letter \"b\" is used both in the beginning and in the middle of\nthe word. Because it phonetically assimilates into sound [w], no\nambiguity is caused.\n","notes":["A separated final form of vowels a or e is common, and can appear at the end of a word, word stem, or suffix. This form requires a final-shaped preceding consonant and an inter-word gap in between. The vowels themselves appear as ᠎ᠠ, and with consonants as ‍ᠬ᠎ᠠ q‑a, ‍ᠷ᠎ᠠ r‑a/r‑e, etc. This gap can be transliterated with a hyphen. In digital typesetting, these forms are triggered by inserting a U+180E ᠎ MONGOLIAN VOWEL SEPARATOR (HTML &#6158; · MVS) between the consonant and vowel.","All case suffixes, as well as any plural suffixes consisting of one or two syllables are likewise separated by a preceding and hyphen-transliterated gap. In digital typesetting, this gap is represented by a U+202F   NARROW NO-BREAK SPACE (HTML &#8239; · NNBSP). A maximum of two case suffixes can be added to a stem. Single-letter vowel suffixes appear with the final-shaped forms of a/e, i, or u/ü, as in ᠭᠠᠵᠠᠷ ᠠ γaǰar‑a 'to the country' and ᠡᠳᠦᠷ ᠡ edür‑e 'on the day', or ᠤᠯᠤᠰ ᠢ ulus‑i 'the state' etc. Multi-letter suffixes most often start with an initial- (consonants), medial- (vowels), or variant-shaped form."],"tests":[{"source":"ᠮᠠᠨ ᠤ ᠤᠯᠤᠰ ᠤᠨ ᠨᠡᠶᠢᠰᠯᠡᠯ ᠬᠣᠲᠠ ᠤᠯᠠᠭᠠᠨᠪᠠᠭᠠᠲᠤᠷ ᠪᠣᠯ 80 000 ᠰᠢᠬᠠᠮ ᠬᠦᠮᠦᠨ ᠲᠡᠢ᠂ ᠤᠯᠤᠰ ᠤᠨ ᠣᠯᠠᠨ ᠨᠡᠶᠢᠲᠡ ᠶᠢᠨ᠂ ᠠᠵᠤ ᠠᠬᠤᠢ ᠶᠢᠨ ᠲᠥᠪ ᠭᠠᠵᠠᠷ ᠤᠳ ᠣᠷᠣᠰᠢᠭᠰᠠᠨ ᠶᠡᠬᠡᠬᠡᠨ ᠣᠷᠣᠨ ᠪᠣᠯᠤᠨ᠎ᠠ᠃\nᠲᠤᠰ ᠤᠯᠤᠰ ᠤᠨ ᠳᠣᠲᠣᠷ᠎ᠠ ᠠᠴᠠ ᠭᠠᠷᠬᠤ ᠲᠦᠭᠦᠬᠡᠢ ᠵᠤᠶᠢᠯ ᠢ ᠪᠣᠯᠪᠠᠰᠤᠷᠠᠭᠤᠯᠬᠤ ᠠᠵᠤ ᠦᠢᠯᠡᠳᠪᠦᠷᠢ ᠶᠢᠨ ᠭᠠᠵᠠᠷ ᠤᠳ ᠢ ᠪᠠᠶᠢᠭᠤᠯᠬᠤ ᠨᠢ ᠴᠢᠬᠤᠯᠠ᠃\n","expected":"man-u ulus-un nejislel kota ulaganbagatur bol 80 000 sikam kymyn-tei, ulus-un olan nejite-jin, aƶu akui-jin tөb gaƶar-ud orosigsan jekeken oron bolun-a.\ntus ulus-un dotor-a-aça garku tygykei ƶujil-i bolbasuragulku aƶu yiledbyri-jin gaƶar-ud-i bajigulku ni çikula.\n"}],"map":{"characters":{"ᠠ":"a","ᠡ":"e","ᠢ":"i","ᠣ":"o","ᠤ":"u","ᠥ":"ө","ᠦ":"y","ᠨ":"n","ᠮ":"m","ᠯ":"l","ᠪ":"b","ᠫ":"p","ᠹ":"f","ᠻ":"k","ᠬ":"k","ᠭ":"g","ᠰ":"s","ᠱ":"ş","ᠲ":"t","ᠳ":"d","ᠴ":"ç","ᠵ":"ƶ","ᠶ":"j","ᠷ":"r","ᠾ":"h","᠁":"...","᠂":",","᠃":".","᠄":":","᠎":"-"," ":"-"}}}}